{"id":21182,"date":"2022-02-02T11:00:00","date_gmt":"2022-02-02T18:00:00","guid":{"rendered":"https:\/\/www.greencentury.com\/after-green-century-shareholder-filing-corning-commits-to-setting-science-based-greenhouse-gas-emissions-reduction-targets\/"},"modified":"2024-06-04T14:44:27","modified_gmt":"2024-06-04T20:44:27","slug":"after-green-century-shareholder-filing-corning-commits-to-setting-science-based-greenhouse-gas-emissions-reduction-targets","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/after-green-century-shareholder-filing-corning-commits-to-setting-science-based-greenhouse-gas-emissions-reduction-targets\/","title":{"rendered":"After Green Century Shareholder Filing, Corning* Commits to Setting Science-Based Greenhouse Gas Emissions Reduction Targets"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p>Media Contact: Andrea Ranger, <a href=\"mailto:tpeterson@greencentury.com\">aranger@greencentury.com<\/a>, 781-349-2813; Josh Chetwynd, <a href=\"mailto:jchetwynd@greencentury.com\">jchetwynd@greencentury.com<\/a>, 303-573-5558<\/p>\n\n\n\n<p>In 2020, as part of its ongoing Curbing Climate Change campaign, Green Century° filed a shareholder proposal with Corning Inc., requesting that the high-profile glass products manufacturer and inventor of pyrex set short-, medium- and long-term science-based greenhouse gas emissions reduction targets. A year after the filing, Corning has taken a significant step toward implementing Green Century’s proposal by announcing its commitment to setting science-based targets with the Science Based Targets initiative – an organization representing the gold standard of corporate emissions reduction commitments.<\/p>\n\n\n\n<p>If approved and implemented, Corning would reduce its absolute Scope 1 and 2 emissions, which result from its operations, by 30%, and its Scope 3 emissions, or emissions from its full value chain, by 17.5% by 2028. In concrete terms, that’s the equivalent of growing 29,029,920 tree seedlings for 10 years or removing 54,545 cars off the road for the next seven years.<\/p>\n\n\n\n<p>“Corning adds so much to our daily lives – from making the fiber optic cables that help us communicate to manufacturing the glass screens that protect our iPhones and iPads,” said Green Century President Leslie Samuelrich. “By making this welcome announcement, they are committing to addressing climate change to their impressive list of work.”<\/p>\n\n\n\n<p>Since 2006, Corning’s Global Energy Management (GEM) teams have identified and implemented a variety of energy-saving measures at the company’s global fiber and cable manufacturing facilities. They have installed LED lights and solar panels, optimized manufacturing equipment, and achieved process improvements. In addition, from 2014 to 2020, the GEM teams have saved the company at least $122 million.  However, despite these efforts, Corning’s greenhouse gas emissions have grown by 62% from 2010 to 2017.<\/p>\n\n\n\n<p>“Corning’s significant increase in emissions concerned us,” said Green Century Shareholder Advocate Andrea Ranger. “However, the company’s new commitment means it’s heading in the right direction, and because electricity represents a majority of its operational emissions, Corning can continue to ramp up sourcing clean, renewable energy while rapidly reducing its carbon footprint. It’s a win-win for Corning, its investors and the planet.”<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14508\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-2-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n\n\n\n<p>###<\/p>\n\n\n\n<p><strong>About Green Century Capital Management<\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are the first family of fossil fuel free, responsible, and diversified mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of December 31, 2021, Corning Incorporated comprised 0.00%, 0.14%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk.<\/p>\n\n\n\n<p>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/p>\n\n\n\n<p>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 2\/22<\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>In 2020, as part of its ongoing Curbing Climate Change campaign, Green Century° filed a shareholder proposal with Corning Inc., requesting that the high-profile glass products manufacturer and inventor of pyrex set short-, medium- and long-term science-based greenhouse gas emissions reduction targets.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[854,857,851,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21182"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21182"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21182\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}