{"id":21191,"date":"2022-03-09T13:53:00","date_gmt":"2022-03-09T20:53:00","guid":{"rendered":"https:\/\/www.greencentury.com\/how-is-your-insurance-company-ensuring-climate-change\/"},"modified":"2024-06-04T14:44:28","modified_gmt":"2024-06-04T20:44:28","slug":"how-is-your-insurance-company-ensuring-climate-change","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/how-is-your-insurance-company-ensuring-climate-change\/","title":{"rendered":"How is Your Insurance Company Ensuring Climate Change?"},"content":{"rendered":"\n<p>By Andrea Ranger<\/p>\n\n\n\n<p>Did you know that the very companies that are supposed to protect us, our families, homes and businesses from fires, hurricanes, floods and hailstorms, are also contributing to climate change?  What kinds of companies, you say? Look no further than your homeowners insurance company. <\/p>\n\n\n\n<p>Most people don’t know that their homeowners insurance company is helping the fossil fuel industry stay afloat. That’s right. Insurance companies such as Travelers,* Chubb,* The Hartford,* Liberty Mutual,* and Berkshire Hathaway* want us to entrust our homes and properties to them while, at the same time, providing insurance coverage to insurance to coal, oil and gas companies.  <\/p>\n\n\n\n<p>It’s hardly a secret that most carbon dioxide emissions come from burning fossil fuels &#8212; roughly 90% per year can be traced back to fossil fuel combustion– and that carbon dioxide is the primary greenhouse gas driving climate change. Yet insurers continue to underwrite exploring, mining, drilling, refining, and transporting fossil fuels even though doing so threatens our homes, businesses, infrastructure and natural resources. Why would they do this? We’ve wondered the same thing, and, unfortunately, the answer may lie in their business model.<\/p>\n\n\n\n<p>Just like your homeowners insurance policy, many other policies written by insurance companies are renewed on an annual basis. This one-year cycle allows insurers to assess their risks and stay on top of any developing trends. As risks increase in a particular geography or to a certain facility or equipment type, an insurer may decide to increase premiums or terminate policies for certain risky areas or clients.<\/p>\n\n\n\n<p>This makes sense. If insurance companies couldn’t make adjustments to their rates or policies, premiums would increase for all of us, or worse, the companies might not be able to make a profit at all and, as a result, go out of business. <\/p>\n\n\n\n<p>But here’s where their business model becomes problematic. Annual renewals of property and casualty policies can put insurers into a short-term thinking mindset which leads insurance companies to accept perverse risks that may be counter to their long-term financial health. Annual policies allow insurers to walk away from fossil fuel projects before their short-term risk becomes too great, but the future emissions from expanded coal mines, tar sands operations, gas and oil well production, and utility plants will haunt us all long after coal, oil and gas operations become uninsurable. By propping the fossil fuel industry, insurance companies are locking us into a future of climate change.  <\/p>\n\n\n\n<p>But that’s not all. When insurers collect our premiums to cover damage from a falling tree or fire, they don’t just keep that money in a giant piggy bank waiting for the next disaster to strike. They take a portion of the funds and invest it – primarily in stocks and bonds. Unbeknownst to you, some of the stocks and bonds they purchase finance coal, oil and gas projects and is a second way that they are supporting the fossil fuel industry.<\/p>\n\n\n\n<p>The International Energy Agency released a report in May 2021, <em>Net Zero by 2050<\/em>, stating that to stabilize the climate, there must be no new fossil fuel production. Yet the companies we’ve come to recognize as trustworthy and reliable are not getting the message. For example, Berkshire Hathaway has no policies limiting its underwriting or investment in fossil fuels. The Hartford, Travelers and Chubb have agreed to stop insuring coal operations, but they’ve also carved out exceptions that you could drive a coal-fired locomotive through and have refused to adopt policies excluding new oil or gas supplies. Lax policies are causing shareholders to press these large insurers to stop underwriting fossil fuel expansion, not only for the sake of all stakeholders but for their own future profitability.<\/p>\n\n\n\n<p>Civil society is also taking notice, and activists&#8217; efforts to make the case to insurance companies have been valiant. In addition to protests, petitions and the occasional meeting granted by an insurer, a concerned group gathered at the U.S. Open in New York in September 2021 and inflated a giant likeness to Chubb CEO Evan Greenberg engulfed in flames. They passed out fans to the gathering tennis-watchers with a written admonition to Chubb for financing ‘dirty fossil fuels’. Remarkably, Chubb announced its intention to stop providing insurance to the famous tar sands deliverer – the Trans Mountain pipeline – shortly thereafter. <\/p>\n\n\n\n<p>People shouldn’t have to spend their time and money creating blow up dolls to get their point across. Similarly, investors shouldn’t have to file shareholder proposals with the world’s largest insurance companies to point out that insuring fossil fuel companies is fundamentally incompatible with protecting the rest of their customers. Insurers need to commit to credible, transparent exit strategies from the fossil fuel industry, and they need to do it now. Otherwise, their short-sighted insurance policies will result in long-term damage to the climate, our homes and ourselves.<\/p>\n<p><span style=\"font-weight: 400;\">Twelve global insurers now restrict underwriting conventional oil and gas projects and\/or companies, far exceeding the scope of exclusions made by US insurance companies. European insurers, including <\/span><a href=\"https:\/\/global.insure-our-future.com\/swiss-re-leads-insurance-exodus-from-oil-and-gas\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Swiss Re<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/us.insure-our-future.com\/fidelis-becomes-first-north-american-insurer-to-restrict-support-for-the-oil-and-gas-industry\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Munich Re<\/span><\/a><span style=\"font-weight: 400;\">, and <\/span><a href=\"https:\/\/global.insure-our-future.com\/hannover-re-oil-gas-exit\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Hannover Re<\/span><\/a><span style=\"font-weight: 400;\">, have been leading the way by announcing oil and gas development-related exclusions despite ongoing fossil fuel supply disruptions caused by geopolitical upheaval. We believe U.S. insurance companies need to follow suit, acknowledge that underwriting risks for the fossil fuel industry creates long lasting climate damage, and shut off the spigot to new oil and gas.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14508\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-2-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n\n\n\n<p><strong>###<\/strong><\/p>\n\n\n\n<p><strong><em>About Green Century Capital Management<\/em><\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). The Green Century Funds are the first family of fossil fuel free, responsible, and diversified mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of December 31, 2021, The Travelers Companies, Inc. comprised 1.18%, 0.18%, and 0.00%, Chubb Limited comprised 0.00% 0.39%, and 0.00%, The Hartford Financial Services Group, Inc. comprised 0.00%, 0.11%, and 0.00%, Liberty Mutual Group, Inc. comprised 0.00%, 0.00%, and 0.00%, and Berkshire Hathaway Inc. comprised 0.00%, 0.00%, and 0.00% of the <a href=\"https:\/\/www.greencentury.com\/balanced-fund\/\">Green Century Balanced Fund<\/a>, the <a href=\"https:\/\/www.greencentury.com\/equity-fund\/\">Green Century Equity Fund<\/a>, and the <a href=\"https:\/\/www.greencentury.com\/international-index-fund\/\">Green Century International Index Fund<\/a> respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n\n\n\n<p><strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 3\/2022<\/em><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Did you know that the very companies that are supposed to protect us, our families, homes and businesses from fires, hurricanes, floods and hailstorms, are also contributing to climate change?  What kinds of companies, you say? Look no further than your homeowners insurance company. <\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[861,856,862,863,853,864],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21191"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21191"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21191\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}