{"id":21192,"date":"2022-03-15T11:00:00","date_gmt":"2022-03-15T17:00:00","guid":{"rendered":"https:\/\/www.greencentury.com\/green-century-trillium-asset-management-and-zevin-asset-management-file-a-shareholder-proposal-with-the-ups-calling-for-ambitious-cuts-to-its-carbon-footprint\/"},"modified":"2024-06-04T14:44:28","modified_gmt":"2024-06-04T20:44:28","slug":"green-century-trillium-asset-management-and-zevin-asset-management-file-a-shareholder-proposal-with-the-ups-calling-for-ambitious-cuts-to-its-carbon-footprint","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/green-century-trillium-asset-management-and-zevin-asset-management-file-a-shareholder-proposal-with-the-ups-calling-for-ambitious-cuts-to-its-carbon-footprint\/","title":{"rendered":"Green Century, Trillium Asset Management and Zevin Asset Management File a Shareholder Proposal with the UPS* Calling for Ambitious Cuts to its Carbon Footprint"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p>Media Contacts: Josh Chetwynd, jchetwynd@greencentury.com, 303-573-5558; Andrea Ranger, aranger@greencentury.com, 781-349-2813<\/p>\n\n\n\n<p><strong>Boston, March 15, 2022 – <\/strong>Green Century°, Trillium Asset Management and Zevin Asset Management have filed a shareholder proposal with United Parcel Service, Inc. (UPS) to push the high-profile delivery company to cut its carbon footprint.<\/p>\n\n\n\n<p>Concerned by the increase in “delivered emissions”, the group previously met with UPS to learn how it was planning to cut the sizable emissions from its air, tractor trailer, and package truck fleets. Although UPS had announced a goal to be carbon neutral by 2050 and had set interim deadlines toward meeting its goal, the details of its ambitions lacked the transparency and rigor that investors have come to expect. For this reason, all three investment managers collaborated on filing a shareholder proposal with UPS calling on the company to set science-based targets with the Science Based Targets initiative, which is the gold standard process for target-setting.<\/p>\n\n\n\n<p>“The time for greenhouse gas emissions reductions is now, and the time for setting clear, measurable, verified emissions reduction targets was yesterday,” said Green Century Shareholder Advocate, Andrea Ranger. “We’re asking UPS, and frankly all of the portfolio companies we engage, to adopt science-based targets. It’s the best way to make sure emissions reductions align with what the science tells us we need to do.”<\/p>\n\n\n\n<p>This proposal comes as the COVID pandemic has led to a big growth in online shopping and door-step deliveries. When a delivery company has planes fly packages from coast-to-coast or its vehicles transport them from either one major hub to another or the last mile to homes or businesses, then it is creating greenhouse gas emissions that drive climate change.<\/p>\n\n\n\n<p>“Investors are very concerned that the longer that UPS waits to transition to a low-carbon future, the harder and costlier it will be,” said Zevin Asset Management Director of Sustainable Investing Marcela Pinilla. “Peers such as DHL*, FedEx*, KLM* and JetBlue* have concrete investment plans to reduce their carbon footprints. UPS should too.”<\/p>\n\n\n\n<p>The Green Century, Zevin Asset Management, and Trillium Asset Management proposal, called “Adoption of Independently Verified Science-Based Greenhouse Gas Emissions Reduction Targets” will appear as Item Number 7 on the UPS proxy statement for its 2022 annual general meeting.<\/p>\n\n\n\n<p>“With the explosion in online shopping during the pandemic, it&#8217;s even more crucial that UPS does its part to avoid catastrophic global consequences,” said Kate Monahan, Director of Shareholder Advocacy at Trillium Asset Management.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>&nbsp;<strong>###<\/strong><\/p>\n\n\n\n<p><strong><em>&nbsp;About Green Century Capital Management<\/em><\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). The Green Century Funds are the first family of fossil fuel free, responsible, and diversified mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>&nbsp;*As of December 31, 2021, the United Parcel Service, Inc. comprised 0.69%, 0.72%, and 0.00%, Deutsche Post AG (DHL) comprised 0.00%, 0.00%, and 1.25%, Federal Express Corporation comprised 0.00%, 0.00%, and 0.00%, Air France–KLM S.A. comprised 0.00%, 0.00%, and 0.00% and JetBlue Airways Corporation comprised 0.00%, 0.00%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p>&nbsp;<strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p>&nbsp;<em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p> <em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds. UMB Distribution Services, LLC. is not affiliated with Trillium Asset Management and Zevin Asset Management.<\/em><\/p>\n\n\n\n<p> <strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 3\/22<\/em><\/strong><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Green Century°, Trillium Asset Management and Zevin Asset Management have filed a shareholder proposal with United Parcel Service, Inc. (UPS) to push the high-profile delivery company to cut its carbon footprint.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[865,857,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21192"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21192"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21192\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21192"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21192"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21192"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}