{"id":21201,"date":"2022-04-25T13:01:00","date_gmt":"2022-04-25T19:01:00","guid":{"rendered":"https:\/\/www.greencentury.com\/citigroup-expands-deforestation-policies-in-response-to-green-century-shareholder-proposal\/"},"modified":"2024-06-21T03:36:58","modified_gmt":"2024-06-21T09:36:58","slug":"citigroup-expands-deforestation-policies-in-response-to-green-century-shareholder-proposal","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/citigroup-expands-deforestation-policies-in-response-to-green-century-shareholder-proposal\/","title":{"rendered":"Citigroup* Expands Deforestation Policies in Response to Green Century Shareholder Proposal"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p><strong>Media Contact:<\/strong> Thomas Peterson, tpeterson@greencentury.com, 781-349-2615<\/p>\n\n\n\n<p><strong>Boston, April 25, 2022 – <\/strong>Green Century° announced on Monday that it has withdrawn its shareholder proposal for Citigroup’s 2022 annual shareholders meeting, scheduled for Tuesday, April 26, after securing a commitment from the bank to adopt improved deforestation policies.<\/p>\n\n\n\n<p>“We cannot achieve global climate goals without ending deforestation this decade. To do that, we must stop the flow of finance to companies that destroy forests,” said Green Century president Leslie Samuelrich. “Citi’s commitment to expanding its forest protection policies is especially significant, as the bank is among the largest financiers of some of the top sectors abetting deforestation.”<\/p>\n\n\n\n<p>Citi’s new commitments will apply to those industries that are responsible for the majority of tropical deforestation: soy, beef, palm oil and forestry. In exchange for the withdrawal of Green Century’s shareholder proposal, Citi has agreed to adopt no-deforestation standards for soy clients operating in high-risk regions, develop a no-deforestation approach for high-risk beef clients, and improve its existing standards for palm oil and forestry clients to align with best practices.<\/p>\n\n\n\n<p>“Banks like Citi cannot credibly achieve their publicly-stated net zero emissions goals without ending financing for companies that drive deforestation,” said Green Century shareholder advocate Thomas Peterson. “With these new commitments, Citi will become the leading U.S. bank when it comes to addressing deforestation exposure in its financing. That’s an important step toward Citi aligning its forest policies with its climate ambitions.”<\/p>\n\n\n\n<p>This commitment from Citi builds on a landmark agreement that Green Century secured <a href=\"https:\/\/www.greencentury.com\/thought-leadership\/\">with JPMorgan Chase<\/a>* last year, when JPMorgan became the first American bank to require its palm oil clients to adopt “No Deforestation, No Peat, No Exploitation” (NDPE) policies. Citi will align with this NDPE policy and expand its scope, while also surpassing JPMorgan with improved forestry sector standards – notably requiring best-practice Forest Stewardship Council (FSC) certification for clients in tropical forests – and with a no-deforestation approach for beef clients.<\/p>\n\n\n\n<p>First Affirmative Financial Network co-filed the Citi proposal with Green Century.<\/p>\n\n\n\n<p>“While Citi still has work to do to ensure that its clients are not driving deforestation, we are encouraged by the steps that the bank is taking to address these risks,” said Holly Testa, Director of Shareowner Engagement for First Affirmative.<\/p>\n\n\n\n<p>Deforestation is responsible for approximately 15% of global emissions, making it the second leading cause of climate change. In addition to exacerbating the climate crisis, deforestation accelerates biodiversity loss, undermines healthy ecosystems, and plays an active role in the spread of infectious diseases.<\/p>\n\n\n\n<p>In 2020, the <a href=\"https:\/\/www.fao.org\/3\/ca8642en\/ca8642en.pdf\" target=\"_blank\" rel=\"noopener\">UN Food and Agriculture Organization<\/a> <a href=\"https:\/\/www.fao.org\/3\/ca8642en\/ca8642en.pdf\" target=\"_blank\" rel=\"noopener\">declared<\/a> that deforestation and forest degradation are taking place at “alarming rates.” A total of 1,621,629 square miles of forest, an area larger than India, has been cleared since 1990, mostly for agricultural expansion.<\/p>\n\n\n\n<p><p>Green Century Capital Management is one of the foremost North American investors engaging companies on risks related to deforestation. Green Century has worked with dozens of corporations to mitigate their exposure to forest-related risks and secured some of the earliest corporate no-deforestation commitments. Learn more about Green Century’s work to prevent deforestation.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14264\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/11\/contact-us-button-300x169.png\" alt=\"\" width=\"300\" height=\"169\"><\/a><\/p><\/p>\n\n\n\n<p><p style=\"text-align: center;\"><strong>###<\/strong><\/p><\/p>\n\n\n\n<p><strong>About Green Century Capital Management<\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are the first family of fossil fuel free, environmentally responsible, mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of March 31, 2022, no securities mentioned were held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n\n\n\n<p><strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 4\/22<\/em><\/strong><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Green Century° announced on Monday that it has withdrawn its shareholder proposal for Citigroup’s 2022 annual meeting.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[878,868,850,857,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21201"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21201"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21201\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21201"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21201"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}