{"id":21212,"date":"2022-05-31T13:12:00","date_gmt":"2022-05-31T19:12:00","guid":{"rendered":"https:\/\/www.greencentury.com\/vote-on-green-century-proposal-at-travelers-concludes-series-of-filings-at-major-insurers\/"},"modified":"2024-06-04T14:44:31","modified_gmt":"2024-06-04T20:44:31","slug":"votes-on-green-century-proposal-at-travelers-concludes-series-of-filings-at-major-insurers","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/votes-on-green-century-proposal-at-travelers-concludes-series-of-filings-at-major-insurers\/","title":{"rendered":"Vote on Green Century Proposal at Travelers* Concludes Series of Filings at Major Insurers"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p>Media Contacts: Andrea Ranger, Shareholder Advocate, <a href=\"mailto:aranger@greencentury.com\">aranger@greencentury.com<\/a>, 781-349-2813<\/p>\n\n\n\n<p>Mark Morgenstein, Media Relations Director, <a href=\"mailto:markm@greencentury.com\">markm@greencentury.com<\/a>, 678-427-1671<\/p>\n\n\n\n<p><strong>Boston, May 31, 2022 – <\/strong>Shareholders voted on Green Century’s° proposal on May 25<sup>th<\/sup> asking Travelers to address its climate risk by ceasing to underwrite new fossil fuel supply. Green Century filed similar proposals with The Hartford* and Chubb* insurance with similar results. Travelers disclosed vote tallies through the Securities and Exchange Commission website, and the percentage in favor of the proposal was 13.2%.  <\/p>\n\n\n\n<p>“The vote results are in line with our expectations for this first-of-its kind proposal with the insurance companies, and we’re very pleased with the early support,” stated Green Century President Leslie Samuelrich. “If the companies fail to take action, the support was strong enough to allow us to refile proposals next year.”<\/p>\n\n\n\n<p>While all three insurance companies restrict underwriting policies for most new coal and tar sands projects, there are still loopholes, and none of the three has restrictions on insuring new gas and oil projects. Both the Intergovernmental Panel on Climate Change and the International Energy Agency say that expanding coal, oil, and gas supply will cause the Earth to warm beyond a 1.5°C temperature rise &#8211; the limit recommended to avert the worst impacts of climate change.<\/p>\n\n\n\n<p>As of 2020, Travelers, Chubb, and The Hartford were among the top ten commercial property and casualty insurers in the world &#8211; Chubb was the largest. That year, the three firms took in $47.8 billion in premiums for this type of insurance.<\/p>\n\n\n\n<p>Natural catastrophes are predicted to continue to challenge insurers&#8217; bottom lines. The Swiss Re Group, a world leader in providing reinsurance and insurance, reported that in 2021, “insured losses from natural disasters again exceeded the previous ten-year average, continuing the trend of an annual 5 &#8211; 6% rise in losses seen in recent decades.” Further, the United Nations has warned that the global temperature rise is likely to reach the 1.5°C mark in under five years. Even the insurers themselves acknowledge the challenges that climate change poses, but shareholders may want them to act more quickly and decisively.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Green Century will keep pushing insurers to stop supporting fossil fuel polluters<\/strong><\/p>\n\n\n\n<p>“Our proposals direct the insurance companies to fulfill their societal mandate to protect. Preventing insured losses is a rational strategy to maintain profits while enhancing customer well-being and shareholder satisfaction,” said Andrea Ranger, Green Century Shareholder Advocate. “But the insurers are engaging in this kind of cognitive dissonance by enabling more and more emissions while at the same time telling their customers they’ve got their backs.”<\/p>\n\n\n\n<p>&nbsp;<strong>###<\/strong><\/p>\n\n\n\n<p><strong><em>&nbsp;About Green Century Capital Management<\/em><\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). The Green Century Funds is one of the first families of fossil fuel free, environmentally responsible, and diversified mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of March 31, 2022, The Travelers Companies, Inc., 1.39%, 0.22%, and 0.00%, The Hartford Financial Services Group, Inc. comprised 0.00%, 0.12%, and 0.00% and Chubb Limited comprised 0.00%, 0.45%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><em>The percentage in favor was calculated by (i) dividing the number of votes in support of the proposal by (ii) the sum of the number of votes voted in support of and against the proposal. Abstentions and broker non-votes were not included in the calculation.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p>&nbsp;<em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n\n\n\n<p>&nbsp;<strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 5\/2022<\/em><\/strong><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Shareholders voted on Green Century’s proposal on May 25th asking Travelers to address its climate risk by ceasing to underwrite new fossil fuel supply.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[856,854,851,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21212"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21212"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21212\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21212"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21212"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21212"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}