{"id":21210,"date":"2022-05-23T11:46:00","date_gmt":"2022-05-23T17:46:00","guid":{"rendered":"https:\/\/www.greencentury.com\/tallies-announced-for-green-century-climate-proposals-votes-at-the-hartford-and-chubb\/"},"modified":"2024-06-04T14:44:31","modified_gmt":"2024-06-04T20:44:31","slug":"tallies-announced-for-green-century-climate-proposals-votes-at-the-hartford-and-chubb","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/tallies-announced-for-green-century-climate-proposals-votes-at-the-hartford-and-chubb\/","title":{"rendered":"Tallies Announced for Green Century Climate Proposals Votes at The Hartford* and Chubb*"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p>Media Contacts: Andrea Ranger, Shareholder Advocate, <a href=\"mailto:aranger@greencentury.com\">aranger@greencentury.com<\/a>, 781-349-2813; Mark Morgenstein, Media Relations Director, <a href=\"mailto:markm@greencentury.com\">markm@greencentury.com<\/a>, 678-427-1671<\/p>\n\n\n\n<p><strong>Boston, May 23, 2022 – <\/strong>Voting results are in for two Green Century<em>°<\/em> shareholder proposals filed with The Hartford and Chubb insurance companies. Green Century filed virtually the same proposal with each company asking them to abide by climate science and stop underwriting fossil fuel expansion. Through filings with the Securities and Exchange Commission, the companies disclosed that 8.8% and 19.4% of votes cast, respectively, were in favor of the proposal. <\/p>\n\n\n\n<p>Green Century President Leslie Samuelrich reacted to the news by saying, “We’re pleased with the vote on the first year of these proposals, which signals that shareholders understand that insuring new fossil fuel development may be bad for business. We believe that underwriting more development of coal, oil and gas &#8212; products whose emissions drive climate change &#8212; while simultaneously collecting premiums from customers who seek protection from climate change, is fundamentally incompatible.”<\/p>\n\n\n\n<p>As of 2020, Chubb was the largest commercial property and casualty insurer in the world; The Hartford ranked 8th. Both are believed to offer significant coverage to the fossil fuel industry, and a recent publication entitled, <a href=\"https:\/\/us.insure-our-future.com\/wp-content\/uploads\/sites\/3\/2022\/02\/IOF-Brazil-report_FINAL_.pdf\" target=\"_blank\" rel=\"noopener\">Fueling Climate Change The Insurers Behind Brazil’s Offshore Oil Expansion<\/a>, reports that Chubb underwrites policies for Brazil’s national oil company, which has the fifth-largest expansion plans of any oil and gas company in the world.<\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\">Green Century’s groundbreaking proposals push insurers to change<\/h2>\n\n\n\n<p>Green Century’s groundbreaking proposals ask Chubb and The Hartford to align their underwriting policies with the International Energy Agency’s report, <a href=\"https:\/\/www.iea.org\/reports\/net-zero-by-2050\" target=\"_blank\" rel=\"noopener\"><em>Net Zero by 2050 Roadmap<\/em><\/a><em>.<\/em> The Roadmap incorporates the recommendation by the Intergovernmental Panel on Climate Change to limit global temperature rise to 1.5 degrees Celsius in order to avert the worst impacts of climate change. In addition, the Roadmap also articulates that new fossil fuel development is incompatible with maintaining the 1.5 degree Celsius limit on temperature increase. <\/p>\n\n\n\n<p>“Because insurance companies are at the forefront of managing risk, helping companies whose products are filling the atmosphere with greenhouse gases makes no sense,” said Green Century Shareholder Advocate Andrea Ranger. “We recognize that our proposal is breaking ground by asking for direct changes to Chubb’s and The Hartford’s underwriting strategies for coal, oil and gas projects, and we’re not deterred by the vote result. We’ll continue to engage Chubb and The Hartford and push for a transition away from underwriting fossil fuel expansion. If necessary, we’ll bring the issue in front of shareholders again.”<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14508\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-2-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n\n\n\n<p>&nbsp;<\/p>\n\n\n\n<p><strong>###<\/strong><\/p>\n\n\n\n<p><strong><em> About Green Century Capital Management<\/em><\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). The Green Century Funds are a family of fossil fuel free, environmentally responsible, and diversified mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of March 31, 2022, The Hartford Financial Services Group, Inc. comprised 0.00%, 0.12%, and 0.00% and Chubb Limited comprised 0.00%, 0.45%, and 0.00% of the <a href=\"https:\/\/www.greencentury.com\/balanced-fund\/\">Green Century Balanced Fund<\/a>, the <a href=\"https:\/\/www.greencentury.com\/equity-fund\/\">Green Century Equity Fund<\/a>, and the <a href=\"https:\/\/www.greencentury.com\/international-index-fund\/\">Green Century International Index Fund<\/a> respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><em>The percentage in favor was calculated by (i) dividing the number of votes in support of the proposal by (ii) the sum of the number of votes voted in support of and against the proposal. Abstentions and broker non-votes were not included in the calculation.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p> <em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n\n\n\n<p> <strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 5\/2022<\/em><\/strong><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Voting results are in for two Green Century° shareholder proposals filed with The Hartford and Chubb insurance companies.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[861,850,856,888,853,885],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21210"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21210"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21210\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21210"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21210"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}