{"id":21217,"date":"2022-06-09T19:42:00","date_gmt":"2022-06-10T01:42:00","guid":{"rendered":"https:\/\/www.greencentury.com\/ambitious-environmentally-focused-shareholder-proposals-leading-to-concrete-corporate-actions\/"},"modified":"2024-06-21T03:01:15","modified_gmt":"2024-06-21T09:01:15","slug":"ambitious-environmentally-focused-shareholder-proposals-leading-to-concrete-corporate-actions","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/ambitious-environmentally-focused-shareholder-proposals-leading-to-concrete-corporate-actions\/","title":{"rendered":"Ambitious Environmentally Focused Shareholder Proposals Leading to Concrete Corporate Actions"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<h2 class=\"wp-block-heading has-medium-font-size\"><meta charset=\"utf-8\"><strong>As Annual Meeting Season Winds Down, Policies to Improve Environment Are Underway<\/strong><\/h2>\n\n\n\n<p><strong>Media Contacts: <\/strong>Thomas Peterson, Shareholder Advocate, <a href=\"mailto:tpeterson@greencentury.com\">tpeterson@greencentury.com<\/a>, 781-349-2615; Mark Morgenstein, Media Relations Director, <a href=\"mailto:mmorgenstein@greencentury.com\">mmorgenstein@greencentury.com<\/a>, 678-427-1671<\/p>\n\n\n\n<p><strong>Boston, June 9, 2022 – <\/strong>As the spate of annual spring shareholder meetings winds down, more than twenty major corporations have committed to action on key environmental proposals championed by Green Century.° Several of Green Century’s proposals achieved record-breaking majority shareholder votes over the course of this season. In addition, other innovative resolutions brought by Green Century achieved enough votes to provide momentum for future success.<\/p>\n\n\n\n<p>“Between the undeniable science of climate change and the material risks that it may pose for investors and for companies across industries, it’s clearer than ever that we all need to do our part to protect our environment,” said Green Century President Leslie Samuelrich. “While individuals can make a difference, it’s a drop in the bucket compared to what a large corporation can do. We applaud the shareholders who are holding their companies accountable and the companies that have committed to act on climate. And we’re making sure that those companies that are lagging notice that the wave of support for climate action is rising.”<\/p>\n\n\n\n<p>Many of the environmentally focused shareholder resolutions presented this year attained higher percentages of yes votes than ever before. Mainstream asset managers – even the “Big Three:” BlackRock<em>, State Street<\/em> and Vanguard* – are increasingly acting on the potential risks to shareholder value posed by climate change and other environmental harms. Considering these higher proxy votes, corporate executives have more incentive to proactively address these issues, rather than have a public proxy fight in front of their shareholders and the media.<\/p>\n\n\n\n<p>With that context, here’s a look at how Green Century’s proposals have influenced some of the world’s best-known brands to make commitments and take actions to improve our environment.<\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong><u>Corporate Actions and Commitments after Shareholder Proposals Filed by Green Century:<\/u><\/strong><\/h2>\n\n\n\n<ol>\n<li><a href=\"https:\/\/www.greencentury.com\/chevron-exits-arctic-national-wildlife-refuge-after-green-century-shareholder-proposals-opposing-arctic-drilling\/\"><strong>Chevron<\/strong><\/a>* has abandoned plans to drill in the Arctic National Wildlife Refuge and has ended its involvement in the Arctic following two successive shareholder proposals from Green Century. Green Century filed an <a href=\"https:\/\/www.greencentury.com\/news\/\">initial proposal<\/a> calling on Chevron to renounce Arctic drilling in December 2020. Though Chevron publicly rebuffed that proposal, the company quietly went about the expensive process of exiting its Arctic leases. The news of Chevron’s Arctic exit finally became public at the end of May.<\/li>\n<\/ol>\n\n\n\n<ol start=\"2\">\n<li><a href=\"https:\/\/www.greencentury.com\/kroger-to-set-science-based-emissions-reduction-targets-in-response-to-green-century-shareholder-proposal\/\"><strong>Kroger<\/strong><\/a><em>*<\/em> committed to set science-based targets to reduce greenhouse gas emissions from its full value chain, agreeing to the request of a Green Century shareholder proposal, withdrawn in April in exchange for this commitment. The shareholder proposal called on the largest U.S. grocery chain to set targets for its Scope 1, 2 and 3 emissions that would lead to net zero emissions by 2050 or sooner. Scope 1 and 2 emissions come from a company’s operations and purchased energy, while the emissions from its supply chains and using its products are Scope 3. Greenhouse gas emissions from the food system represent roughly a third of all planet-warming emissions.<\/li>\n<\/ol>\n\n\n\n<ol start=\"3\">\n<li><a href=\"https:\/\/www.greencentury.com\/statement-mattel-follows-through-on-plastic-reduction-commitment\/\"><strong>Mattel<\/strong><\/a><strong>* <\/strong>announced in April that it plans to reduce the amount of plastic packaging with its products. The company, which makes a wide array of popular toys from Barbie dolls to Hot Wheels cars, <a href=\"https:\/\/corporate.mattel.com\/news\/mattel-announces-goal-to-reduce-plastic-packaging-by-25-per-product-by-2030-and-publishes-latest-citizenship-report\" target=\"_blank\" rel=\"noopener\">announced<\/a><a href=\"https:\/\/corporate.mattel.com\/news\/mattel-announces-goal-to-reduce-plastic-packaging-by-25-per-product-by-2030-and-publishes-latest-citizenship-report\" target=\"_blank\" rel=\"noopener\"> <\/a>a new goal to reduce plastic packaging by 25% per product by 2030. Mattel’s action comes after the toymaker reached an agreement last year with Green Century for the fund to withdraw a related shareholder proposal.<\/li>\n<\/ol>\n\n\n\n<ol start=\"4\">\n<li><a href=\"https:\/\/www.greencentury.com\/lowes-commits-to-comprehensive-reporting-of-its-forest-footprint-will-also-explore-elimination-of-sourcing-from-primary-forests\/\"><strong>Lowe’s<\/strong><\/a>* agreed in March to accelerate its efforts to eliminate deforestation and the logging of old growth forests in its supply chains. Notably, Lowe’s is evaluating whether it can end sourcing from forests that have never been logged. Lowe’s is one of the world’s largest home improvement retailers and a major purchaser of wood products. Lowe’s largest competitor, <a href=\"https:\/\/www.greencentury.com\/statement-majority-of-home-depot-shareholders-support-deforestation-shareholder-proposal-filed-by-green-century\/\"><strong>Home Depot<\/strong><\/a>,* would not agree to take action on a similar proposal, so Green Century brought it to a vote and 65% of the company’s shareholders instructed it to follow in Lowe’s footsteps in May.<\/li>\n<\/ol>\n\n\n\n<ol start=\"5\">\n<li><a href=\"https:\/\/www.greencentury.com\/statement-coca-cola-announces-refillable-packaging-goal-prompted-by-proposal-from-green-century-and-as-you-sow\/\"><strong>Coca-Cola<\/strong><\/a>* announced in February that it had set a <a href=\"https:\/\/www.coca-colacompany.com\/news\/coca-cola-announces-industry-leading-target-for-reusable-packaging\" target=\"_blank\" rel=\"noopener\">new goal<\/a> to have at least 25% of all beverages sold globally distributed in refillable or returnable bottles or in refillable containers through the company’s fountain business by 2030. It is the first known goal of its kind. Currently, reusable packaging accounts for 16% of the company’s beverage portfolio. The announcement comes after Green Century and As You Sow co-led the filing of a proposal urging the company to reduce its reliance on single-use plastic and increase its use of refillable and reusable packaging.<\/li>\n<\/ol>\n\n\n\n<ol start=\"6\">\n<li><a href=\"https:\/\/www.greencentury.com\/thought-leadership\/\"><strong>Apple<\/strong><\/a>* announced in November 2021 that it would provide individual consumers access to replacement parts, tools and repair manuals needed to perform common repairs to its products, starting with the iPhone 12 and 13 lineups. The announcement came on the same day that Green Century had to decide whether to press forward on a right-to-repair shareholder proposal. Apple has historically resisted allowing consumers or independent repair shops to perform repairs and has vigorously lobbied against legislation that would require them to allow others to fix their products. So, the announcement was a notable reversal for the company. Apple <a href=\"https:\/\/www.greencentury.com\/statement-apple-launches-self-service-repair-program\/\">launched the program<\/a> in April.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong><u>Recent Shareholder Votes That Can Provide Leverage for Green Century to Secure Policies:<\/u><\/strong><\/h2>\n\n\n\n<ol start=\"7\">\n<li><a href=\"https:\/\/www.greencentury.com\/amazon-shareholders-support-green-century-plastic-packaging-proposal\/\"><strong>Amazon<\/strong><\/a>* shareholders just missed garnering a majority vote in May for a proposal urging the company to significantly reduce its use of plastic packaging. The proposal earned 48.9% support, the highest-ever vote in favor of an environmentally focused shareholder proposal at the company, according to a <a href=\"https:\/\/engagements.ceres.org\/\" target=\"_blank\" rel=\"noopener\">Ceres database<\/a> that tracks shareholder proposals. When Green Century and As You Sow filed a similar proposal last year, it earned support from 35% of shareholders. At the time, <em>that<\/em> was the new standard for environmentally focused proposals at Amazon. Despite the increasing shows of support for improving plastic policies, the leading e-retailer has yet to adequately respond to investor concerns.<\/li>\n<\/ol>\n\n\n\n<ol start=\"8\">\n<li><a href=\"https:\/\/www.greencentury.com\/votes-on-green-century-proposal-at-travelers-concludes-series-of-filings-at-major-insurers\/\"><strong>Chubb,* Travelers,* and The Hartford<\/strong><\/a>,* three of the fifteen largest commercial property and casualty insurance companies in the world, had shareholder votes on their ballots in May related to Green Century’s new “Insure a Fossil Free Future” campaign. Green Century filed virtually the same proposal with each company, asking them to align with climate science and stop underwriting fossil fuel expansion. The proposals garnered “for” votes from <a href=\"https:\/\/www.greencentury.com\/tallies-announced-for-green-century-climate-proposals-votes-at-the-hartford-and-chubb\/\">19.4%, 13.2%, and 8.8%<\/a> of the insurers’ shareholders, respectively, exceeding the thresholds required to re-file the proposal at each company.<\/li>\n<\/ol>\n\n\n\n<ol start=\"9\">\n<li><a href=\"https:\/\/www.greencentury.com\/majority-of-costco-shareholders-support-landmark-green-century-proposal-on-climate-change\/\"><strong>Costco<\/strong><\/a><strong>* <\/strong>shareholders in January voted overwhelmingly in favor of a Green Century proposal requesting that the company set targets for emissions throughout its full value chain that are aligned with achieving net zero emissions by 2050. Nearly 70% of voting shareholders sent a signal that it is unacceptable that Costco lacks science-based emissions reduction targets and fails to account for Scope 3 emissions related to agriculture, land use change and deforestation in its supply chains. Leading up to the January vote, Green Century’s proposal prompted substantial improvements in Costco’s climate policy. Costco announced an expedited timeline for disclosing supply chain emissions; committed to developing a Scope 3 action plan and reduction targets; and most significantly, nearly a year earlier than planned, announced its first reduction targets for its operational and purchased energy (Scope 1 and 2) emissions. A similar Green Century proposal received a remarkable 88.5% vote at <a href=\"https:\/\/www.greencentury.com\/statement-green-century-shareholder-proposal-on-climate-change-wins-vote-with-88-5-approval-at-us-foods-annual-meeting\/\"><strong>US Foods<\/strong><\/a>* in May.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong><u>Green Century’s Work and Influence on Factory Farming:<\/u><\/strong><\/h2>\n\n\n\n<ol start=\"10\">\n<li><a href=\"https:\/\/www.greencentury.com\/thought-leadership\/\"><strong>McDonald’s<\/strong><\/a>* has been a frequent target of Green Century’s shareholder advocacy in recent years because of the fast-food giant’s reliance on unsustainable factory farming practices. In 2022, Green Century’s work on this issue was thrust into the spotlight when famed investor Carl Icahn nominated Green Century President Leslie Samuelrich to McDonald’s board of directors. While shareholders opted not to elect Samuelrich, the publicity raised awareness of Green Century’s work on animal welfare issues and we’ve seen an uptick in improved animal welfare policies from numerous other companies, presumably to avoid a board seat fight of their own. Green Century’s actions have provided leverage to partners doing the heavy lifting on similar campaigns. For example, the U.S. Humane Society has credited the McDonald’s board fight with helping pressure <strong>CVS*<\/strong> and <strong>Walgreens*<\/strong> to accelerate their transitions to cage-free eggs, pushing <strong>General Mills*<\/strong> and <strong>Denny’s*<\/strong> to move towards elimination of gestation crates in their pork supply chains, and leading to new commitments from <strong>Conagra Brands*<\/strong> and the<strong> Cheesecake Factory*<\/strong> to make progress on both cage-free eggs and gestation crate-free pork. <\/li>\n<\/ol>\n\n\n\n<p>If you would like to speak to Leslie Samuelrich about any of the companies mentioned above, or about anything regarding environmentally-sound investing, please email Media Relations Director Mark Morgenstein at <a href=\"mailto:mmorgenstein@greencentury.com\">mmorgenstein@greencentury.com<\/a> or call him at 678-427-1671.<\/p>\n\n\n\n<p><strong>###<\/strong><\/p>\n\n\n\n<p><strong><em>About Green Century Capital Management<\/em><\/strong><em><\/em><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are a family of fossil fuel-free, environmentally responsible mutual funds. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n\n\n\n<p><em>*As of March 31, 2022, BlackRock, Inc. comprised 0.00%, 0.57%, and 0.00%; State Street Corporation comprised 0.48%, 0.16%; The Kroger Co. comprised 0.00%, 0.20%, and 0.00%; Mattel, Inc. comprised 0.00%, 0.04%, and 0.00%; The Home Depot, Inc. comprised 0.96%, 1.54%, and 0.00%; Lowe’s Companies, Inc. comprised 0.00%, 0.67%, and 0.00%; The Coca-Cola Company comprised 0.00%, 1.25%, and 0.00%; Apple, Inc. comprised 5.70%, 0.00%, and 0.00%; Chubb Ltd. comprised 0.00%, 0.45%, and 0.00%; The Travelers Companies, Inc. comprised 1.39%, 0.22%, and 0.00%; The Hartford Financial Services Group, Inc. comprised 0.00%, 0.12%, and 0.00%; Costco Wholesale Corporation comprised 1.45%, 0.00%, and 0.00%; McDonald’s Corporation comprised 0.00%, 0.91%, and 0.00%; CVS Health Corp. comprised 0.76%, 0.00%, and 0.00%; General Mills, Inc. comprised 0.00%, 0.20%, and 0.00%; and Conagra Brands comprised 0.00%, 0.08%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund and the Green Century International Index Fund, respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><em>The percentage in favor was calculated by (i) dividing the number of votes in support of the proposal by (ii) the sum of the number of votes voted in support of and against the proposal. Abstentions and broker non-votes were not included in the calculation.<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n\n\n\n<p><strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 6\/22<\/em><\/strong><em><\/em><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>As the spate of annual spring shareholder meetings winds down, more than twenty major corporations have committed to action on key environmental proposals championed by Green Century.°<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[854,851],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21217"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21217"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21217\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}