{"id":21222,"date":"2022-08-18T18:27:00","date_gmt":"2022-08-19T00:27:00","guid":{"rendered":"https:\/\/www.greencentury.com\/statement-vote-tallies-released-for-shareholder-proposal-that-asks-tesla-for-clear-policies-on-climate-lobbying\/"},"modified":"2024-06-26T10:16:25","modified_gmt":"2024-06-26T16:16:25","slug":"statement-vote-tallies-released-for-shareholder-proposal-that-asks-tesla-for-clear-policies-on-climate-lobbying","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/statement-vote-tallies-released-for-shareholder-proposal-that-asks-tesla-for-clear-policies-on-climate-lobbying\/","title":{"rendered":"STATEMENT: Vote Tallies Released for Shareholder Proposal that Asks Tesla* for Clear Policies on Climate Lobbying"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t\n<p><strong>Media Contacts: <\/strong>Andrea Ranger, Shareholder Advocate, <a href=\"mailto:aranger@greencentury.com\">aranger@greencentury.com<\/a>, 781-349-2813;&nbsp;Mark<strong> <\/strong>Morgenstein, Media Relations Director, <a href=\"mailto:mmorgenstein@greencentury.com\">mmorgenstein@greencentury.com<\/a>, 678-427-1671<\/p>\n\n\n\n<p><strong>Boston, August 18, 2022 <\/strong>– A <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/0001318605\/000156459022024064\/tsla-def14a_20220804.htm#PROPOSAL_TEN\" target=\"_blank\" rel=\"noopener\">shareholder proposal<\/a> on climate lobbying, filed by the Nathan Cummings Foundation and Green Century°, won 34.6% of the vote, according to Tesla’s SEC filings. Removing the presumed “no” votes of the roughly 17% of inside shares, including those held by CEO Elon Musk, independent shareholders may have delivered a majority of 51% of votes cast in support. <\/p>\n\n\n\n<p>The proposal calls on Tesla to publish an evaluation of how its “lobbying and policy influence activities (direct and through trade associations and social welfare and nonprofit organizations) align with the Paris Agreement’s goal to limit average global warming to 1.5 degrees Celsius [by 2100], and how Tesla plans to mitigate risks presented by any misalignment.”<\/p>\n\n\n\n<p>Despite Tesla’s considerable contributions to expanding the clean energy and electric vehicle markets, the company has provided limited disclosure on how its board oversees public policy decisions that could affect the growth of the clean energy market and broader climate initiatives. For example, late in 2021, <a href=\"https:\/\/www.wsj.com\/articles\/elon-musk-comes-out-against-federal-electric-vehicle-spending-11638892791?mod=e2fb&amp;tesla=y\" target=\"_blank\" rel=\"noopener\">CEO Elon Musk<\/a> signaled opposition to federal incentives for installing electric vehicle charging stations. Investors were left to wonder whether Mr. Musk’s comments reflected Tesla’s viewpoint or whether he had veered from Tesla’s stance on the benefits of charging station incentives. Better board management of disclosure practices may have helped.<\/p>\n\n\n\n<p>&nbsp;<strong>Green Century President Leslie Samuelrich issued this statement about the vote result:<\/strong><\/p>\n\n\n\n<p>“We’re pleased with this vote count indicating that our call for better governance practices and lobbying disclosures made sense to our fellow investors. In my mind, the vote doesn’t in any way diminish Tesla’s unparalleled innovations in the electric vehicle and renewable energy spaces nor its critical role in limiting transportation-related greenhouse gas emissions. Rather, it’s a reminder that investors care about business risk as it manifests across a company’s operations, which includes how a company influences public policy.&nbsp; We hope Tesla will take the vote result in that spirit.”&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>Green Century Shareholder Advocate Andrea Ranger added:<\/strong><\/p>\n\n\n\n<p>“Tesla clearly has a role in the much-needed transformation to a clean energy-powered future, but when you look under the hood, you want to see what makes the company run. Is the company’s direct and indirect lobbying through trade associations and business alliances working to limit the conditions leading to climate change? Is the board implementing its oversight role of Tesla’s lobbying activities? These are the types of questions we’d like Tesla to answer, and we believe the investor concern we’ve now seen should motivate the board to respond.”<\/p>\n\n\n\n<p><strong><em>#<\/em>##<\/strong><\/p>\n\n\n\n<p><strong><em>About Green Century Capital Management<\/em><\/strong><\/p>\n\n\n\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds).<\/em><\/p>\n\n\n\n<p><em>*As of June 30, 2022, Tesla, Inc. comprised 0.00%, 3.50%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n\n\n\n<p><em>The percentage in favor was calculated by (i) dividing the number of votes in support of the proposal by (ii) the sum of the number of votes voted in support of and against the proposal. Abstentions and broker non-votes were not included in the calculation.&nbsp;<\/em><\/p>\n\n\n\n<p><strong><em>You should carefully consider the Funds’ investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds, please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n\n\n\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<p><strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 8\/22<\/em><\/strong><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>A shareholder proposal on climate lobbying, filed by the Nathan Cummings Foundation and Green Century°, won 35% of the vote, according to Tesla’s SEC filings.<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[854,851,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21222"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21222"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21222\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21222"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21222"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21222"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}