{"id":21231,"date":"2022-09-26T20:40:00","date_gmt":"2022-09-27T02:40:00","guid":{"rendered":"https:\/\/www.greencentury.com\/statement-texas-comptroller-includes-green-century-funds-on-list-of-investments-to-exclude-from-public-pension-funds\/"},"modified":"2024-06-04T14:44:34","modified_gmt":"2024-06-04T20:44:34","slug":"statement-texas-comptroller-includes-green-century-funds-on-list-of-investments-to-exclude-from-public-pension-funds","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/statement-texas-comptroller-includes-green-century-funds-on-list-of-investments-to-exclude-from-public-pension-funds\/","title":{"rendered":"Statement: Texas Comptroller includes Green Century Funds on list of investments to exclude from public pension funds"},"content":{"rendered":"<p>Media contacts: Leslie Samuelrich, lsamuelrich@greencentury.com; 781-349-2830<br \/>\nMark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671 <\/p>\n<p>BOSTON, August 25, 2022 &#8212; Texas State Comptroller Glenn Hegar released a list Wednesday of 10 financial companies that he claims  “boycott” fossil fuel companies. Hegar included Green Century in that list and all three of the Green Century Funds are included among 350 funds.<\/p>\n<p>The listed companies are subject to the divestment provisions outlined in Texas Government Code Chapter 809, which defines a financial company as a publicly traded financial services, banking or investment company. Additionally, the Comptroller’s staff conducted research on individual investment funds, generating the list of nearly 350 funds that are subject to the same provisions as the companies. <\/p>\n<p>None of the state governmental entities subject to the investment prohibitions and divestment requirements (Employees Retirement System of Texas, Teacher Retirement System of Texas, Texas Municipal Retirement System, Texas County and District Retirement System, Texas Emergency Services Retirement System and the Permanent School Fund) currently invest in the Green Century Funds. <\/p>\n<p>In response to the announcement, Green Century Capital Management President Leslie Samuelrich issued the following statement: <\/p>\n<p>“We are proud that the Green Century Funds constitute the first family of fossil fuel free funds, which are both environmentally friendly and diversified. We strive to make all of our decisions in the best interest of our shareholders, many of whom are aware of our motto and chose us intentionally because we exclude coal, oil and gas companies.  <\/p>\n<p>“ Comptroller Hegar and the Texas legislature are weaponizing the state’s pension funds to do the bidding of the fossil fuel industry. That same industry has driven the climate crisis linked to the heat waves, droughts and erratic weather &#8212; such as the recent devastating floods in Dallas &#8212; that Texans, and everyone else, regardless of their political beliefs, are facing. We believe that the hard-working individuals of Texas should have the freedom to invest in ways that reflect their environmental values and protect their quality of life without intrusion from the state.”<\/p>\n<p>About Green Century Capital Management<\/p>\n<p>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). <\/p>\n<p>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/p>\n<p>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/p>\n<p>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/p>\n<p>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 8\/2<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Media contacts: Leslie Samuelrich, lsamuelrich@greencentury.com; 781-349-2830 Mark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671 BOSTON, August 25, 2022 &#8212; Texas State Comptroller Glenn Hegar released a list Wednesday of 10 financial [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21231"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21231"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21231\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21231"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21231"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21231"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}