{"id":21230,"date":"2022-09-14T19:21:00","date_gmt":"2022-09-15T01:21:00","guid":{"rendered":"https:\/\/www.greencentury.com\/what-is-shareholder-engagement-and-does-it-matter-how-to-understand-what-an-impact-report-really-means\/"},"modified":"2024-06-04T14:44:34","modified_gmt":"2024-06-04T20:44:34","slug":"what-is-shareholder-engagement-and-does-it-matter-how-to-understand-what-an-impact-report-really-means","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/what-is-shareholder-engagement-and-does-it-matter-how-to-understand-what-an-impact-report-really-means\/","title":{"rendered":"What is ‘shareholder engagement’ and does it matter? How to understand what an impact report really means"},"content":{"rendered":"<p><em>*Read President Leslie Samuelrich’s GreenFin article on What is real ‘shareholder engagement’ and does it matter? She explains the differences between proxy voting, engagement and advocacy&#8230;<\/em><\/p>\n<p>When I got to the exhibit hall at a recent sustainable investing conference, surrounded by banners of beautiful nature shots, I focused on collecting impact reports from the exhibitors. Each was impressive in its own way &#8212; the charts, the photos or the sheer volume of the 32-page report that I ended up returning since it wouldn’t fit in my suitcase. <\/p>\n<p>Over the last five years, impact reports have become standard fare for firms that claim their investment products make positive impacts on the world. As a fellow veteran of the responsible investing field leafed through a report, he quipped that he mostly skims the reports and looks at the photos. While his comment was partially in jest, I realized that even for seasoned investors, well-produced materials could make it difficult to discern the real differences between investments that purport to make an impact. <\/p>\n<p>Most investors hold the largest majority of their investments in public equities, not community-based investing, private equity or green bonds, all of which offer direct ways to make a measurable impact. That makes for a straightforward impact report. However, while you can align your values to the mission of public equities, your shares make little difference to what the investment firm does. For example, you can invest in a fund that includes renewable energy companies, but your investment will not produce additional solar panels or wind turbines. This is an often overlooked reality, blurred by marketing materials that may imply a direct correlation between your investment and real changes in the environment by frequent use of buzzwords such as “impact” or “sustainable investing.” <\/p>\n<p>If you want to impact the world, you should look for mutual funds or investment firms that have a shareholder engagement program. The number of firms that now tout “shareholder engagement” has proliferated as these institutions try to show (often in impact reports how their investments make a difference.<\/p>\n<p>“Shareholder engagement” is a broad, unregulated term, otherwise known as stewardship or shareholder advocacy, which is the term that Green Century Funds uses. It can mean any activity that seeks to inform or persuade a company to change 1) how it reports or 2) how it handles an environmental, social or governance problem or opportunity.  Let’s break down the different approaches:<\/p>\n<p><strong>Proxy voting<\/strong><\/p>\n<p>This is the process of voting on a shareholder resolution that has been put forth by another investor (the company also asks for votes on questions that largely concern governance). Voting allows a firm to express its views but relies on other shareholders to identify the issue, propose a solution and get the shareholder resolution on the proxy ballot, sometimes after the company asks the Securities and Exchange Commission to not allow it on the ballot. This is the most common type of activity, because all mutual funds are supposed to vote on every shareholder resolution on the ballots. These resolutions are advisory, not binding, so a majority vote won’t necessarily result in the proposed change. However, a strong vote can provide useful leverage for the resolution proponent when they negotiate with the company.<\/p>\n<p><strong>What to look for:<\/strong><br \/>\n•\tDoes the investment firm have voting guidelines that you support?<br \/>\n•\tDo they vote in accordance with their guidelines for only their ESG products or all of their funds?<br \/>\n•\tDo they publish their voting guidelines and records on their website? <\/p>\n<p><strong>What can be misleading:<\/strong><br \/>\n•\tClaiming that voting for a resolution directly resulted in a policy change<br \/>\n•\tImplying that voting on a resolution is the same as filing the resolution and leading the subsequent negotiations with the company  <\/p>\n<p><strong>Company engagement<\/strong><\/p>\n<p>Speaking to companies to gather information, analyze a holding or express a concern are forms of shareholder engagement. It does not always mean advocating for impactful change. Many firms roll all of their engagement questions into a regularly scheduled analyst meeting so your topic may be one of many covered in a conversation  <\/p>\n<p>At The Green Century Funds, our engagements evaluate a company’s understanding of relevant environmental issues and risks we have identified. We want to see if the company needs to improve its policies or we want to ensure the company acts on commitments that we previously secured.  <\/p>\n<p><strong>What to look for:<\/strong><br \/>\n•\tResults. What came about because of the engagement?  Was it a meeting to gather information and what did the info reveal?  <\/p>\n<p>•\tDoes the firm provide data or stories on how a company has met the terms of a past agreement?<br \/>\n<strong><br \/>\nWhat can be misleading:<\/strong><br \/>\n•\tNumber of “engagements.”  This number can show if a firm is tracking its work and the breadth of the conversations but does not indicate results. Each firm can count this number differently, so look for the firm’s definition of “engagement meeting.”<\/p>\n<p>•\tPrivate results. If a firm claims that its engagement produces results, it should provide evidence. Some firms, notably BlackRock, report on the frequency and topic issues included in discussions, but have resisted reporting on the results. That leaves investors in the dark about if and how companies change their practices vis-a-vis the engagement.<\/p>\n<p><strong>Shareholder Advocacy<\/strong><\/p>\n<p>By definition, this approach goes beyond seeking information to pressure a company to change a policy or practice. While shareholder advocacy programs frequently use proxy voting and engagement, the reverse is not frequently the case. <\/p>\n<p><strong>What to look for:<\/strong><br \/>\n•\tDid the company change its policy?<br \/>\n•\tIs the policy measurable? For example: the 25% reduction in the use of new plastics that we persuaded Coca-Cola to adopt.<br \/>\n•\tDoes the new policy have a deadline or timeline for implementation, or it is just an aspirational statement? Specifics are essential (i.e source 50% more renewable energy by 2025.). <\/p>\n<p><strong>What can be misleading:<\/strong><br \/>\n•\tIssuing a report:  Having a company understand an issue and publicly report metrics on an issue is important for transparency. But companies can report without taking steps to change their practice or policy. If getting an agreement to do an assessment is reported as a success, the firm should also state what it has done with similar results in the past or plans.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>*Read President Leslie Samuelrich’s GreenFin article on What is real ‘shareholder engagement’ and does it matter? She explains the differences between proxy voting, engagement and advocacy&#8230; When I got to [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[854,898,899,900],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21230"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21230"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21230\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21230"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21230"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21230"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}