{"id":21239,"date":"2022-12-15T10:00:00","date_gmt":"2022-12-15T17:00:00","guid":{"rendered":"https:\/\/www.greencentury.com\/green-century-as-you-sow-file-shareholder-proposal-with-amazon-seeking-disclosure-of-entire-carbon-footprint\/"},"modified":"2024-06-04T14:44:36","modified_gmt":"2024-06-04T20:44:36","slug":"green-century-as-you-sow-file-shareholder-proposal-with-amazon-seeking-disclosure-of-entire-carbon-footprint","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/green-century-as-you-sow-file-shareholder-proposal-with-amazon-seeking-disclosure-of-entire-carbon-footprint\/","title":{"rendered":"Green Century, Amalgamated Bank file shareholder proposal with Amazon seeking disclosure of entire carbon footprint"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t<p><strong>Media Contacts:<\/strong><\/p>\n<p>Andrea Ranger, Shareholder Advocate, aranger@greencentury.com, 781-349-2813<\/p>\n<p>Mark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671<\/p>\n<p><strong>Boston, December 15, 2022<\/strong> – Green Century° and Amalgamated Bank led the filing of a shareholder proposal Thursday pressing Amazon to fully quantify and disclose its scope 3 greenhouse gas emissions. Scope 3 emissions, which include things such as transportation that occur outside of a company’s direct control, can represent an enormous portion of a retailer’s carbon footprint. Last year, Walmart and Target reported on every category of their scope 3 emissions, which comprised 95% and 97% of their total greenhouse gas output, respectively. By contrast, Amazon reported on only a portion of its scope 3 emissions.<\/p>\n<p>For example, in 2021, Amazon only disclosed product-related emissions for its Amazon-branded products such as Kindles, Fire TVs or Whole Foods’ 365 products. However, private-label products represent a mere 1% of its sales. The rest of the products it sells directly or through third party vendors, comprise 39% and 60% of total sales, respectively. Unlike Amazon, Walmart and Target do not parse out emissions from their private-label brands versus products from other manufacturers or products sold on their third-party platforms. It’s likely, therefore, that Amazon is significantly undercounting its total emissions.<\/p>\n<p>“What Amazon is doing &#8212; or, should I say, not doing &#8212; is not acceptable,” said Green Century Funds President <a href=\"https:\/\/www.greencentury.com\/meet-our-team\/\">Leslie Samuelrich<\/a>. “It needs to play by the same set of rules as everyone else and disclose all indirect emissions up and down its value chain. As climate-concerned investors, we believe Amazon has a responsibility to use its vast resources and influence to reduce its burgeoning carbon footprint.”<\/p>\n<h3><strong>Emissions grow but Amazon’s greenhouse gas emissions disclosures are still lacking<\/strong><\/h3>\n<p>In 2019, Amazon launched an ambitious initiative called the Climate Pledge, inviting other companies to commit to achieve net-zero greenhouse gas emissions by 2040 &#8212; 10 years ahead of the Paris Agreement’s target year of 2050. Since that time, Amazon’s sales have nearly doubled, in large part due to pandemic-fueled at-home purchasing; consequently, Amazon’s greenhouse gas emissions &#8212; at least the ones it discloses &#8212; have risen by nearly 40% in the same time period.<\/p>\n<p>“Walmart and Target are doing the math for all the brands they sell &#8211; from bottles of Tide to Samsung TVs. They’re adding up all the emissions that go into making the bottle, the laundry detergent, the energy used by the washing machine, and they’re counting the emissions that go into the parts and pieces of the TV, and the electricity used to run the TV once it’s home,” Green Century Shareholder Advocate <a href=\"https:\/\/www.greencentury.com\/meet-our-team\/\">Andrea Ranger<\/a> said. “This accounting is important because you can’t manage what you can’t measure. We fully expect that Walmart and Target will use their influence to lean on manufacturers to cut their emissions in smart and timely ways. Amazon needs to get on board and do likewise – now.”<\/p>\n<p style=\"text-align: center;\">###<\/p>\n<p><strong>About The Green Century Funds<\/strong><\/p>\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are one of the first families of fossil fuel free mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n<p><em>*As of September 30, 2022, Target Corporation comprised 1.08%, 0.44%, and 0.00% of the  <a href=\"https:\/\/www.greencentury.com\/balanced-fund\/\">Green Century Balanced Fund<\/a><\/em><em>, the <a href=\"https:\/\/www.greencentury.com\/equity-fund\/\">Green Century Equity Fund<\/a><\/em><em>, and the <a href=\"https:\/\/www.greencentury.com\/international-index-fund\/\">Green Century International Index Fund<\/a><\/em><em>, respectively. As of the s<\/em><em>ame date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n<p><strong>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/strong><\/p>\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n<p><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 12\/22<\/em><\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Media Contacts: Andrea Ranger, Shareholder Advocate, aranger@greencentury.com, 781-349-2813 Mark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671 Boston, December 15, 2022 – Green Century° and Amalgamated Bank led the filing of a [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[890,850,854,857,853,906],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21239"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21239"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21239\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21239"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21239"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21239"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}