{"id":21236,"date":"2022-11-16T13:56:00","date_gmt":"2022-11-16T20:56:00","guid":{"rendered":"https:\/\/www.greencentury.com\/release-green-century-shareholder-proposal-prompts-costco-commitment-to-set-new-climate-emissions-reduction-targets\/"},"modified":"2024-06-04T14:44:34","modified_gmt":"2024-06-04T20:44:34","slug":"release-green-century-shareholder-proposal-prompts-costco-commitment-to-set-new-climate-emissions-reduction-targets","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/release-green-century-shareholder-proposal-prompts-costco-commitment-to-set-new-climate-emissions-reduction-targets\/","title":{"rendered":"RELEASE: Green Century shareholder proposal prompts Costco* commitment to set new climate emissions reduction targets"},"content":{"rendered":"\t\t\t\t\t\t<div class=\"single-post-body wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n\t\t\t\t\t\t\t\t<div class=\"single-post-content wp-block-column wp-block-column-is-layout-flow\">\n\t\t\t\t\t<p>Media Contacts:<br \/>\nAnnie Sanders, Director of Shareholder Advocacy, asanders@greencentury.com, 773-272-6691<br \/>\nMark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671<\/p>\n<p>Boston, November 14, 2022 – In response to a Green Century° shareholder proposal, Costco,* one of the largest retailers in the world, has committed to setting climate emissions reduction targets for its full value chain &#8212; cumulatively called “scope 3” emissions &#8212; in 2023. The commitment comes after 70% of its voting shareholders opted in January 2022 for a Green Century proposal asking Costco to include the emissions from its producers, shippers and other partners when setting targets to reach net zero emissions by 2050.<\/p>\n<p>“With this commitment, Costco is no longer a laggard among its peers. So, we congratulate the company on committing to reduce its contribution to climate change,” said Green Century President Leslie Samuelrich. “Costco’s plan to set a scope 3 emissions reduction target in 2023 shows that the company is starting to treat climate change with the gravity that the issue – and shareholders – demand.”<\/p>\n<p>Historically, Costco has significantly trailed many of its competitors on climate action, standing out as one of only three of the largest 50 S&#038;P companies without a major climate commitment as of December 2021. At Costco’s January 2022 annual meeting, Green Century called on the company to set science-based emissions reduction targets for its scope 1, 2, and 3 emissions that would lead to achieving net zero emissions by 2050 or sooner. Scope 1 and 2 emissions are those from a company’s operations and purchased energy, while the emissions from its supply chains and the use of its products are known as scope 3.<\/p>\n<p>In response, Costco committed to disclosing the company’s aggregate scope 3 emissions and action plan in 2022, and to set scope 3 reduction targets in 2023, which likely represents the vast majority of the company’s climate impact. (For context, Walmart* has estimated that for retailers, roughly 95% of emissions are in scope 3.) In addition, Costo committed to updating its scope 1 and 2 emissions targets and action plans as part of its revised Climate Action Plan coming out in December 2022.<\/p>\n<p>“Costco has certainly accelerated its work on this issue and we are pleased that it is heeding the call from shareholders to address climate risk,” said Green Century’s Director of Shareholder Advocacy Annie Sanders. “That said, we are disappointed that the company has declined to pursue alignment of the company’s climate targets with the Science Based Targets initiative, the global body enabling businesses to set emissions reduction targets in line with science. We strongly urge Costco to join its peers in taking this crucial step to avoid the worst consequences of climate change and mitigate climate risk in line with investor expectations.”<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/contact\/\"><img decoding=\"async\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/11\/contact-us-button-300x169.png\" alt=\"\" width=\"300\" height=\"169\" class=\"alignnone size-medium wp-image-14264\" \/><\/a><\/p>\n<p>###<\/p>\n<p>About Green Century Capital Management<br \/>\n°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). <\/p>\n<p>*As of September 30, 2022, Costco Wholesale Corporation comprised 1.39%, 0.00%, and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/p>\n<p>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing. <\/p>\n<p>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria. <\/p>\n<p>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/p>\n<p>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 11\/22<\/p>\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t\t<style>\n\t\t\t\t.single-post-tag-group {\n\t\t\t\t\tdisplay: none !important;\n\t\t\t\t}\n\t\t\t<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Media Contacts: Annie Sanders, Director of Shareholder Advocacy, asanders@greencentury.com, 773-272-6691 Mark Morgenstein, Media Relations Director, mmorgenstein@greencentury.com, 678-427-1671 Boston, November 14, 2022 – In response to a Green Century° shareholder proposal, [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[311],"tags":[856,904,854,851,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21236"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21236"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21236\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21236"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21236"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21236"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}