{"id":21243,"date":"2022-12-28T17:22:00","date_gmt":"2022-12-29T00:22:00","guid":{"rendered":"https:\/\/www.greencentury.com\/top-ten-green-century-highlights-from-2022\/"},"modified":"2024-11-29T09:44:36","modified_gmt":"2024-11-29T16:44:36","slug":"top-ten-green-century-highlights-from-2022","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/top-ten-green-century-highlights-from-2022\/","title":{"rendered":"Top 10 Green Century Highlights from 2022"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">2022 was a big year for Green Century. Thank you, the investors in the Green Century Funds, for your commitment to align your investments with your values, your steadfast support during a challenging market, and your dedication to making a positive impact in our world. We work with companies to secure improved environmental policies and practices to help them mitigate their material risks and create real world impact for our investors. We use honed strategies, deep engagements, and high volume – this fall alone, we have met with dozens of companies and filed 28 shareholder proposals – to produce results. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here are our top 10 highlights:<\/span><\/p>\n<p><b>10. Leading in green bond investments<\/b><span style=\"font-weight: 400;\">. Green bonds are issued by companies, governments, and supranational institutions to help finance environmental and climate change mitigation projects around the world. The <\/span><a href=\"https:\/\/www.greencentury.com\/balanced-fund\/\"><span style=\"font-weight: 400;\">Green Century Balanced Fund<\/span><\/a><span style=\"font-weight: 400;\"> purchased its first green bond<\/span><\/p>\n<figure id=\"attachment_24137\" aria-describedby=\"caption-attachment-24137\" style=\"width: 300px\" class=\"wp-caption alignright\"><img decoding=\"async\" class=\"wp-image-24137 size-full\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Picture1-300x199-1.jpg\" alt=\"\" width=\"300\" height=\"199\" \/><figcaption id=\"caption-attachment-24137\" class=\"wp-caption-text\">A green bond in the Green Century Balanced Fund supports El Salvador’s Bósforo solar project.<\/figcaption><\/figure>\n<p><span style=\"font-weight: 400;\">in 2008 and the percentage in the fixed income portion of the Balanced Fund has risen from 15% in 2013 to <\/span><b>64% in 2022.<\/b><span style=\"font-weight: 400;\"> While the marketing of green bonds is expanding, not all “green” bonds fund projects with measurable environmental benefits. Green Century has a high standard for inclusion and all of the bonds have earned the Green Bond label. A current green bond is financing the construction of 10 solar power plants in rural, low-income areas of El Salvador, which will help meet growing energy demand and reduce El Salvador’s dependence on imported fuel.<\/span><\/p>\n<p><b>9. Clarifying Environmentally Responsible Options for Investors.<\/b><span style=\"font-weight: 400;\"> Earlier this month, <\/span><span style=\"font-weight: 400;\">the US SIF Foundation released their biannual “Trends” report that showed that “ESG” investments &#8211; investments integrating environmental, social and governance data &#8211; totaled $8.4 trillion in 2022, compared to $17.1 trillion in 2020. What at first looks like a significant decline in interest is likely a result of a changed methodology and some big firms from counting their assets as ESG assets this time. The findings serve as a reminder that in the last five years, many new firms with a variety of investment strategies have entered the field, which has left investors to sort through the marketing claims.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Green Century believes the proposed rules by the Securities and Exchange Commission (SEC) to prevent misleading or deceptive fund names and requiring more detailed ESG disclosure by funds will help protect investors from those who may wish to take advantage of investor interest in sustainable investing. The Green Century Funds <\/span><a href=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/11\/GCCM-Prospectus-11.28.22.pdf\"><span style=\"font-weight: 400;\">prospectus<\/span><\/a><span style=\"font-weight: 400;\"> details our approach and we have spoken about the differences between using ESG ratings and integration, values-based screens and creating impact through advocacy extensively in the last year.  Comments from recent media interviews are featured in these <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-08-17\/-hating-esg-advocates-rethink-label-as-us-culture-wars-bite?sref=Brs3FVmA\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Bloomberg<\/span><\/a><span style=\"font-weight: 400;\">  and <\/span><a href=\"https:\/\/www.reutersevents.com\/sustainability\/esg-investment-worlds-troubled-teen-forced-grow\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Reuters<\/span><\/a><span style=\"font-weight: 400;\"> articles. <\/span><\/p>\n<p> <\/p>\n<p><b>8. Protecting the Arctic National Wilderness Refuge.<\/b><span style=\"font-weight: 400;\"> Our award-winning shareholder advocacy program capped off the spring season with a <\/span><a href=\"https:\/\/www.greencentury.com\/chevron-exits-arctic-national-wildlife-refuge-after-green-century-shareholder-proposals-opposing-arctic-drilling\/\"><span style=\"font-weight: 400;\">win at Chevron<\/span><\/a><span style=\"font-weight: 400;\">.* The company has abandoned plans to drill in the Arctic National Wildlife Refuge and has ended its involvement in<img decoding=\"async\" class=\"size-medium wp-image-14546 alignleft\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/screenshot-miro.medium.com-2022.12.22-09_40_52-300x213.png\" alt=\"\" width=\"300\" height=\"213\" \/> the Arctic region following two successive shareholder proposals from the Green Century Funds. While Chevron publicly rebuffed Green Century’s initial proposal calling on the company to renounce Arctic drilling in December 2020, it quietly went about the expensive process of exiting its Arctic leases. The news of Chevron’s Arctic exit became public at the end of May. <\/span><span style=\"font-weight: 400;\">The Intergovernmental Panel on Climate Change and the International Energy Agency say that expanding coal, oil and gas supply will cause the Earth to warm beyond 1.5 degrees Celsuis &#8211; the limit to avert the worst impacts of climate change. To stop new fossil fuel projects, Green Century led unprecedented shareholder action to hold Chubb,* The Hartford,* and Travelers accountable, and Marketwatch reported on our advocacy in its <\/span><a href=\"https:\/\/www.marketwatch.com\/story\/influential-fund-manager-green-century-tells-big-insurers-to-drop-big-oil-11645049047\" target=\"_blank\" rel=\"noopener\"><i><span style=\"font-weight: 400;\">Influential Fund Manager Tells Big Insurers to Drop Big Oil<\/span><\/i><\/a><span style=\"font-weight: 400;\"> article.<\/span><\/p>\n<p><b>7. Moving Beyond Plastic with our non-profit owners. <\/b>Green Century’s unique ownership by non-profits means that 100% of the net proceeds earned on managing the Green Century Funds belongs to the environmental and public health groups, <a href=\"https:\/\/www.greencentury.com\/about-us\/\">nine Public Interest Research Groups,<\/a> that founded us. In California, one of our owners, CALPIRG, <a href=\"https:\/\/pirg.org\/updates\/volunteers-organizers-leaders-celebrate-californias-landmark-plastic-reduction-law\/\" target=\"_blank\" rel=\"noopener\">celebrated the passage of the Plastic Pollution Producer Responsibility Act<\/a> in October. The new law requires companies to reduce the amount of plastic they use in their products, specifically mandating a 25% reduction in plastic packaging and foodware. The law additionally requires that all single-use food packaging be recyclable, so less ends up in landfills and the environment. As our owners pass state legislation to reduce plastic, the Green Century staff has successfully negotiated plastic reduction <a href=\"https:\/\/www.greencentury.com\/?s=coca-cola\">agreements with Coca-Cola<\/a>* and <a href=\"https:\/\/www.greencentury.com\/statement-mattel-follows-through-on-plastic-reduction-commitment\/\">Mattel<\/a>,* and kicked off the 2022-23 shareholder season by securing a majority vote on plastic reduction at <a href=\"https:\/\/www.greencentury.com\/general-mills-shareholders-call-for-less-plastic-packaging-over-55-of-voting-shareholders-opt-for-green-century-proposal\/\">General Mills<\/a>*, which was the first majority vote on an environmental proposal this fall.<\/p>\n<p><b>6. Receiving a Climate Change Leadership Award<\/b><span style=\"font-weight: 400;\">. The Pulitzer Prize-winning news organization selected the Green Century Funds President (me!) as one of the 30 honorees <\/span><span style=\"font-weight: 400;\">in its <\/span><a href=\"https:\/\/www.businessinsider.com\/climate-action-30-top-global-leaders-working-toward-climate-solutions-2022\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Climate Action 30 list<\/span><\/a><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">. Announced to coincide with Climate Week in NYC this fall, the group of<\/span><\/span><\/p>\n<p><img decoding=\"async\" class=\"alignleft wp-image-14548 size-medium\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/Picture2-300x300.png\" alt=\"\" width=\"300\" height=\"300\" \/><\/p>\n<p><span style=\"font-weight: 400;\">30 includes global leaders from multiple sectors. I am very proud of how the Green Century Funds offer individuals, small businesses and organizations the opportunity to invest fossil fuel free and push companies to curb climate change so we move off of fossil fuels to a clean energy economy. <\/span><\/p>\n<p><b>5. Challenging McDonald’s board…and spurring companies to act on factory farming<\/b><span style=\"font-weight: 400;\">. <\/span>I was nominated to McDonald’s board of directors by Carl Icahn, one of the first “activist investors”,  to highlight the company’s broken<img decoding=\"async\" class=\"size-medium wp-image-14545 alignright\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/pig-300x282.jpg\" alt=\"\" width=\"300\" height=\"282\" \/> promise to end the use of gestation crates for pregnant sows. While McDonald’s has yet to live up to its initial commitment, the board campaign received widespread media coverage and the U.S. Humane Society has credited this visibility and pressure in moving CVS* and Walgreens* to accelerate their transitions to cage-free eggs and pushing General Mills* and Denny’s* to move towards elimination of gestation crates in their pork supply chains.<\/p>\n<p><b>4. Protecting Forests and Biodiversity with one of the world&#8217;s largest home improvement retailers.<\/b> In March, Lowe’s agreed to accelerate its efforts to eliminate deforestation and the logging of old growth forests in its supply chains. Roughly 90% of Lowe&#8217;s wood comes from North America, including from Canada’s boreal forest, which constitutes 25% of the world’s remaining intact forest and is home to a rich variety of wildlife including the gray wolf. Canada’s boreal forest stores twice as much carbon per hectare as tropical forests, which was a key reason Green Century expanded our work in this region.<\/p>\n<p><b>3. Banned and proud of it.<\/b> In August, Texas banned <a href=\"https:\/\/www.greencentury.com\/the-green-century-funds\/\">Green Century Funds<\/a>, along with 345 investment funds, from being used by state and some local entities because they don&#8217;t invest in the oil and gas industry. As one of the first families of fossil fuel free mutual funds, Green Century has been an outspoken supporter of the global fossil fuel divestment campaign and <a href=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/10\/Divest-Invest-Movement-2-Pager-9.30.22.pdf\">its success<\/a>. Mainstream asset managers such as Blackrock, which has <a href=\"https:\/\/www.blackrock.com\/corporate\/sustainability\" target=\"_blank\" rel=\"noopener\">tried to portray itself<\/a> as a sustainability leader, have gone to great lengths to now publicize how <i>much ($170 billion dollars)<\/i> they invest in these dirty industries in an effort to be removed from these lists in Texas, Louisiana and Florida. While I believe Blackrock is playing both sides of the field, the Green Century Funds are focused on reducing our reliance on dirty energy and are proud to be one of the first families of fossil fuel free mutual funds. This year, we launched a campaign to convince insurance companies to stop underwriting new fossil fuel projects that was featured in Marketwatch’s article <a href=\"https:\/\/www.marketwatch.com\/story\/influential-fund-manager-green-century-tells-big-insurers-to-drop-big-oil-11645049047\" target=\"_blank\" rel=\"noopener\">Influential Fund Manager Green Century Tells Big Insurers to Drop Big Oil.<\/a><\/p>\n<p><b>2. Pushing Costco to set greenhouse gas emissions targets<\/b><span style=\"font-weight: 400;\">. In 2021, Costco* refused to set climate emissions reduction targets when Green Century staff engaged with the company. After 70% of its voting shareholders supported the <\/span><a href=\"https:\/\/www.greencentury.com\/equity-fund\/\"><span style=\"font-weight: 400;\">Green Century Equity Fund’s<\/span><\/a><span style=\"font-weight: 400;\"> subsequent proposal on this issue and we held follow-up discussions with the company, Costco has now committed to setting carbon pollution reductions. This win is important because Costco was one of only three of the 50 largest S&amp;P companies without a major climate commitment last December and because it will set emissions reductions across its full supply chain &#8211; called “scope 3”emissions &#8211; which is the source of the majority of its emissions.<\/span><\/p>\n<p><b>1. Having the support of investors like you. <\/b><span style=\"font-weight: 400;\">Our number one highlight of 2022 is the support of investors in <\/span><a href=\"https:\/\/www.greencentury.com\/the-green-century-funds\/\"><span style=\"font-weight: 400;\">The Green Century Funds<\/span><\/a><span style=\"font-weight: 400;\">. None of our work would be possible without you.  If you want to add to your account or <\/span><a href=\"https:\/\/www.greencentury.com\/open-an-account\/\"><span style=\"font-weight: 400;\">open a new account<\/span><\/a><span style=\"font-weight: 400;\">, the end of the year is a great time to make your <\/span><a href=\"https:\/\/www.greencentury.com\/?s=IRA+contributions\"><span style=\"font-weight: 400;\">IRA contributions for 2022<\/span><\/a><span style=\"font-weight: 400;\"> or open an account for a loved one. Thank you for choosing to align your investments with your values.<\/span><\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14508\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-2-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n<p><b>About Green Century Capital Management<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">*As of September 30, 2022, Chevron, Chubb Ltd., The Hartford Financial Services Group Inc., The Travelers Companies Inc., The Coca-Cola Company, Mattel, Inc., General Mills, Inc., CVS Health Corp., Walgreens, General Mills, Inc. and Denny’s comprised 0.00%, 0.00%, and 0.00%; 0.00%, 0.49% and 0.00%; 0.00%, 0.13% and 0.00%; 0.00%, 0.23% and 0.00%; 0.00%, 1.47% and 0.00%; 0.00%, 0.04% and 0.00%; 0.00%, 0.29% and 0.00%;<\/span><\/i> <i><span style=\"font-weight: 400;\"> 0.84%, 0.00%, and 0.00%; 0.00%, 0.00% and 0.00%; 0.00%, 0.29% and 0.00% and 0.00%, 0.00% and 0.00% of the Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/span><\/i><\/p>\n<p><b>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 12\/22<\/span><\/i><\/p>\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"300\" height=\"199\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Picture1-300x199-1.jpg\" alt=\"\" class=\"wp-image-24137\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"300\" height=\"199\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Picture1-300x199-1.jpg\" alt=\"\" class=\"wp-image-24137\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"300\" height=\"199\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Picture1-300x199-1.jpg\" alt=\"\" class=\"wp-image-24137\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" width=\"300\" height=\"199\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Picture1-300x199-1.jpg\" alt=\"\" class=\"wp-image-24137\"\/><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>2022 was a big year for Green Century. Thank you, the investors in the Green Century Funds, for your commitment to align your investments with your values, your steadfast support [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21243"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21243"}],"version-history":[{"count":3,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21243\/revisions"}],"predecessor-version":[{"id":24140,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21243\/revisions\/24140"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}