{"id":21249,"date":"2023-01-26T17:33:00","date_gmt":"2023-01-27T00:33:00","guid":{"rendered":"https:\/\/www.greencentury.com\/insightia-monthly-interviews-annie-sanders-and-andrea-ranger-on-all-things-shareholder-advocacy-going-green\/"},"modified":"2024-08-15T14:54:33","modified_gmt":"2024-08-15T20:54:33","slug":"insightia-monthly-interviews-annie-sanders-and-andrea-ranger-on-all-things-shareholder-advocacy-going-green","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/insightia-monthly-interviews-annie-sanders-and-andrea-ranger-on-all-things-shareholder-advocacy-going-green\/","title":{"rendered":"Insightia Monthly Interviews Annie Sanders and Andrea Ranger on All Things Shareholder Advocacy | Going Green"},"content":{"rendered":"<h5><span style=\"font-weight: 400;\">December 2022<\/span><\/h5>\n<h5><span style=\"font-weight: 400;\">By Rebecca Sherratt<\/span><\/h5>\n<p><i><span style=\"font-weight: 400;\">An interview with Annie Sanders, Director of Shareholder Advocacy, and Andrea Ranger, Shareholder Advocate, at Green Century Capital Management. Founded in 1991, Green Century is an investment advisory firm based in Massachusetts that manages environmentally responsible funds.  <\/span><\/i><\/p>\n<h4><b>Green Century&#8217;s sustainability proposals target a broad range of issues, how do you identify companies to engage with on these topics? <\/b><\/h4>\n<p><b><img decoding=\"async\" class=\"alignleft size-thumbnail wp-image-13901\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/09\/Annie-Sanders-Headshot-150x150.png\" alt=\"\" width=\"150\" height=\"150\" \/>Annie Sanders (AS): <\/b><span style=\"font-weight: 400;\">To speak on plastic pollution and deforestation engagements, we contemplate a number of factors when working out who to engage with. One of our key considerations is identifying which companies are not only well-positioned to drive change but also lagging behind peers in their sustainability commitments. We also analyze a company’s supply chain to identify how companies in the chain could help move an issue or affect the decision-making of a larger entity. <\/span><span style=\"font-weight: 400;\">Looking broadly across all sectors is also important, and we try to engage with issuers in sectors where perhaps not a lot of activity has taken place on deforestation, right-to-repair reporting, or plastic pollution. We are often one of the first investors to engage with a particular company around a given issue, so we like to think of ourselves as ESG trailblazers, in that sense.<\/span><\/p>\n<p><b><img decoding=\"async\" class=\"alignleft size-thumbnail wp-image-14823\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2023\/01\/Ranger-Andrea-Square-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/>Andrea Ranger (AR): <\/b><span style=\"font-weight: 400;\">In terms of climate change, our remit as a mutual fund that excludes any companies involved in fossil fuels from developers to utilities is to look for ways to continue to phase out fossil fuels to prevent the worst impacts of climate change. We look for opportunities to really push the envelope out on climate commitments, like asking companies to commit to near-, medium-, and long-term science-based greenhouse gas emission reduction targets. Now, we are also making a foray into asking companies to disclose their climate transition action plans.<\/span><\/p>\n<h4><\/h4>\n<h4><\/h4>\n<h4><b>Shareholder proposals faced criticism this year for being overly prescriptive and poorly targeted. What are your thoughts on this?  <\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AR:<\/strong> This narrative is certainly an interesting one. This trend basically boils down to the Securities and Exchange Commission (SEC) issuing a legal bulletin last November, mandating that shareholder proposals can no longer be omitted if they relate to issues of broad social or ethical concern. Because of this bulletin, everyone pushed the envelope out. Investors were no longer filing proposals asking for watered-down reporting, which, in prior years, was the only way to get ESG proposals past the SEC. The new Biden era SEC administration has a much broader view of material risks and so investors took a more aggressive approach in their engagements to mirror the urgency needed to address climate change. <\/span><span style=\"font-weight: 400;\">Investors asked companies to adopt more specific policies and report on specific goals, like science-based emissions targets, for example. The advent of the war in Ukraine also tipped the scales, so leading fund managers could say ESG proposals were not providing boards with enough flexibility. We see this whole pushback to ESG as the “BlackRocks” of the world walking back on their ESG commitments, especially on climate.<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Green Century made the history books this year for receiving the highest level of support for any plastic-related shareholder proposal in history, with its request for Jack in the Box to report on its sustainable packaging endeavors winning 95.4% support, despite facing management opposition<\/span><\/i><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h4><b>In your experience, are companies more open to engaging with shareholders now than they have been in previous years?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AS:<\/strong> I think that certainly seems to be the trend. Companies are realizing that climate risk is also economic risk and so they need to start taking these concerns seriously.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>AR:<\/strong> ESG issues are becoming unavoidable and I think companies are now seeing it’s best to get on top of these issues rather than giving investors the stiff arm and ignoring us. I can think of several companies that, in previous years, have certainly just given investors the stiff arm but are now starting to engage with and recognize these issues.<\/span><\/p>\n<h4><b>Texas comptroller Glen Hegar recently placed Green Century on a list of financial institutions deemed to be &#8220;boycotting&#8221; energy firms. Do you think the growing anti-ESG movement could pose an issue for responsible investors?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AR:<\/strong> The way we view ESG at Green Century is that it is a continuum of the broad spectrum of risks investors look at when deciding whether to invest in a company, so it is unfortunate ESG has been categorized as a separate set of risks from financial risks. They’re just risks. As a fiduciary, we have to look at the financial value and performance of a stock but also need to look at those ESG risks which are just as pertinent to financial performance. In terms of what we do, the anti-ESG kerfuffle is not affecting us. Investors come to us because of the values we hold, they are not going to divest from us because of “woke” capitalism. <\/span><span style=\"font-weight: 400;\">I think a lot of the sound and fury coming from anti-ESG groups like the Texas Comptroller have given some of the larger asset managers pause. BlackRock is in this weird position, saying on the one hand that yes, it is committed to ESG but, on other hand, proclaiming it has invested millions of dollars into Texas oil and gas. BlackRock is very much between a rock and a hard place. <\/span><\/p>\n<p><span style=\"font-weight: 400;\"><strong>AS:<\/strong> Although the ESG backlash is very vocal, it does also form a relatively small minority of investors and other entities. I think ESG and sustainable investing will only continue to grow, despite the barrage of criticism and accusations.<\/span><\/p>\n<h4><b>What key topics will Green Century be focusing on in the coming proxy season?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AR:<\/strong> Currently, we are engaging with a fast-food chain and a food producer on antimicrobial resistance (AMR). Unlike in Europe, where antibiotic use in all forms is more restricted, here in the U.S. we are starting at a much lower tier of getting routine use of medically important antibiotics out of the food chain. We will also be calling on companies to commit to science-based emissions targets through the Science-based Targets Initiative (SBTi), looking for climate action transition plans, and again looking at the fossil fuel underwriting of leading U.S. insurance companies. We have meetings coming up with many issuers on these topics so we will see what happens. Some engagements may escalate to proposal filings.<\/span><\/p>\n<h4><b>We are often one of the first investors to engage with a particular company around a given issue, so we like to think of ourselves as ESG trailblazers. <\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AS:<\/strong> We’ll also be continuing our work to urge companies that source forest-risk commodities to mitigate climate and nature-related risk by eliminating deforestation and native vegetation conversion from their supply chains. Finally, we’ll continue our focus on plastic pollution by asking companies to reduce their plastic packaging footprint in order to mitigate the flow of 11 million tons of plastic waste released into the ocean every year.<\/span><\/p>\n<h4><b>If you could introduce one corporate governance reform, either in the U.S. or internationally, what would it be?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\"><strong>AR:<\/strong> Both issuers and investors would benefit from having someone on the board who is actually fluent in sustainability issues. A director well-versed in climate change would be very valuable, but even someone who has some understanding of broader sustainability issues like deforestation or plastic pollution would be welcomed. Looking at the qualifications of U.S. corporate board members, there is very little ESG <\/span><span style=\"font-weight: 400;\">experience among directors. And even when you find a director with what might still be only a limited amount of ESG experience, these directors sit on each others’ boards, bringing little new perspective to the table.<\/span><\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/invest-with-us\/\"><img decoding=\"async\" class=\"alignnone size-medium wp-image-14508\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-2-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n<p><b>About The Green Century Funds<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). <\/span><\/i><\/p>\n<p><b>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 1\/23<\/span><\/i><\/p>\n<div class=\"disclosures-content\"><p><b>About The Green Century Funds<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds). <\/span><\/i><\/p>\n<p><b>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 1\/23<\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>December 2022 By Rebecca Sherratt An interview with Annie Sanders, Director of Shareholder Advocacy, and Andrea Ranger, Shareholder Advocate, at Green Century Capital Management. Founded in 1991, Green Century is [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[854,920,853],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21249"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21249"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21249\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21249"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21249"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21249"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}