{"id":21269,"date":"2023-05-04T15:05:00","date_gmt":"2023-05-04T21:05:00","guid":{"rendered":"https:\/\/www.greencentury.com\/what-is-shareholder-advocacy\/"},"modified":"2024-06-04T14:44:39","modified_gmt":"2024-06-04T20:44:39","slug":"what-is-shareholder-advocacy","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/what-is-shareholder-advocacy\/","title":{"rendered":"What is Shareholder Advocacy &#038; Why is it Important"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">A popular term in the investment industry right now is shareholder advocacy, but what is considered shareholder advocacy and why has it become such a hot button topic? Shareholder advocacy is a tool that is used by investors to push a company to report on or change a policy, usually around environmental, social or governance issues. Shareholder advocacy takes the form of discussions, shareholder resolutions, proxy votes and other actions. These are very effective ways to drive change toward sustainability for a company or an industry. Shareholder advocacy can also push laggard companies that need to be held accountable for failing to address risks and push them to catch up to peer companies. Shareholder advocacy for Green Century Funds centers on environmental issues. <\/span><\/p>\n<h3>What is Shareholder Advocacy?<\/h3>\n<p><span style=\"font-weight: 400;\">Shareholder advocates assess the reputational, competitive, regulatory, and legal risks that a company faces and brings these issues to the attention of corporate management. Shareholder advocates lead dialogues with company executives to learn how the company is addressing an issue. If needed, shareholder advocates press for changes through negotiations or by filing a shareholder resolution. For example, Green Century shareholder advocates learned that Costco* did not have any greenhouse gas emissions goals to address the company’s potential climate risk and larger role in the world.  Our shareholder advocates held  several meetings, filed a shareholder advocacy proposal and won a majority vote on the issue. The upshot is Green Century advocates were successful in getting <\/span><a href=\"https:\/\/www.greencentury.com\/release-green-century-shareholder-proposal-prompts-costco-commitment-to-set-new-climate-emissions-reduction-targets\/\"><span style=\"font-weight: 400;\">Costco* to adopt greenhouse gas emission goals<\/span><\/a><span style=\"font-weight: 400;\">. Green Century advocates push for action on today’s most pressing environmental issues, including plastic pollution, animal welfare, reducing carbon emissions and sourcing renewable energy. For us, shareholder advocacy means helping a company reduce its’ material risks while securing changes that improve our air, water, and land. <\/span><\/p>\n<h3>Who Can Be a Shareholder Advocate?<\/h3>\n<p><span style=\"font-weight: 400;\">Exactly who can be a shareholder advocate? Typically, a shareholder advocate is an individual or group of investors who try to influence corporate management. An individual who owns stock in a company, provided they meet certain requirements, can engage with a company. More commonly, shareholder advocates work for an asset manager such as a mutual fund or asset owner such as a state pension fund. <\/span><\/p>\n<h3>Why is Shareholder Advocacy Important?<\/h3>\n<p><span style=\"font-weight: 400;\">Shareholder advocacy is a very effective way for investors to help change corporate policy concerning environmental or social corporate policies. As investors increasingly become interested in sustainable investing, they want to know if their mutual funds and asset managers have a shareholder engagement or shareholder advocacy program with strong  track records.  If the shareholder advocacy program is effective, investors see how they can align their values with making a positive impact in the world.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Green Century’s shareholder advocates have successfully pushed <\/span><a href=\"https:\/\/www.greencentury.com\/statement-coca-cola-announces-refillable-packaging-goal-prompted-by-proposal-from-green-century-and-as-you-sow\/\"><span style=\"font-weight: 400;\">Coca-Cola* to reduce its’ plastic use<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.greencentury.com\/lowes-commits-to-new-protections-for-global-forests-green-century\/\"><span style=\"font-weight: 400;\">Lowe’s* to source more sustainably grown timber<\/span><\/a><span style=\"font-weight: 400;\">, and <\/span><a href=\"https:\/\/www.greencentury.com\/statement-green-century-shareholder-proposal-results-in-new-jack-in-the-box-animal-welfare-commitment\/\"><span style=\"font-weight: 400;\">Jack in the Box to get rid of gestation crates used for pregnant sows<\/span><\/a><span style=\"font-weight: 400;\">.  Green Century&#8217;s award winning program has helped change companies, supply chains, and industries for more than two decades.<\/span><\/p>\n<h3>How Does Green Century Support Shareholder Advocacy?<\/h3>\n<p><span style=\"font-weight: 400;\">Green Century Funds negotiates with companies to improve their corporate sustainability practices by reducing their reliance on fossil fuels, protecting ocean wildlife from plastic pollution, adopting sustainable agriculture policies and more. Furthermore, once companies make commitments, Green Century Funds assesses the progress of companies in fulfilling pledges and holds them accountable to their commitments.<\/span><\/p>\n<h3>Invest With Green Century Funds<\/h3>\n<p><span style=\"font-weight: 400;\">The Green Century Funds are one of the first families of fossil fuel free, environmentally responsible and sustainable mutual funds. <\/span><a href=\"https:\/\/www.greencentury.com\/about-us\/\"><span style=\"font-weight: 400;\">For more than 30 years<\/span><\/a><span style=\"font-weight: 400;\">, Green Century Funds has been helping people save for their future without compromising their values. <\/span><a href=\"https:\/\/www.greencentury.com\/why-choose-green-century\/\"><span style=\"font-weight: 400;\">Our three-pronged approach<\/span><\/a><span style=\"font-weight: 400;\"> includes sustainable investing strategies, an award-winning shareholder advocacy program and 100 percent ownership by nonprofit organizations doing critical work to protect the environment and public health.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">An investment strategy that incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">If you have any additional questions about shareholder advocacy or would like to begin your journey of sustainability investing, contact Green Century Funds today.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><img decoding=\"async\" class=\"alignleft size-medium wp-image-14264\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/11\/contact-us-button-300x169.png\" alt=\"\" width=\"300\" height=\"169\" \/><\/p>\n<p><b>About Green Century<\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are one of the first families of fossil fuel free mutual funds in the United States. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/span><\/i><\/p>\n<p><b><i>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds<\/i><\/b><a href=\"https:\/\/www.greencentury.com\/request-materials\/\"> <b><i>please click here<\/i><\/b><\/a><b><i>, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/i><\/b><\/p>\n<p><i><span style=\"font-weight: 400;\">Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 4\/23. UMB and Green Century are unaffiliated.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A popular term in the investment industry right now is shareholder advocacy, but what is considered shareholder advocacy and why has it become such a hot button topic? Shareholder advocacy [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21269"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21269"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21269\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21269"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21269"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21269"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}