{"id":21282,"date":"2023-05-30T16:23:00","date_gmt":"2023-05-30T22:23:00","guid":{"rendered":"https:\/\/www.greencentury.com\/qa-investors-warn-of-the-risks-of-inaction-on-plastics\/"},"modified":"2024-06-04T15:14:57","modified_gmt":"2024-06-04T21:14:57","slug":"qa-investors-warn-of-the-risks-of-inaction-on-plastics","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/qa-investors-warn-of-the-risks-of-inaction-on-plastics\/","title":{"rendered":"Q&#038;A: Investors warn of the risks of inaction on plastics"},"content":{"rendered":"<p><em>Green Century has worked in recent years to push food, beverage and personal care brand companies to reduce their plastic packaging, develop more packaging reuse programs and introduce more transparent reporting of progress. We&#8217;ve recently engaged with companies including Coca Cola*, General Mills*, Sysco*, Colgate-Palmolive* and Keurig Dr. Pepper* on these issues.<\/em><\/p>\n<p><em>Green Century&#8217;s Director of shareholder advocacy, Annie Sanders, spoke to Argus Media about Green Century&#8217;s motives and place in the industry, the changing of attitudes of investors towards companies that do not make meaningful progress and the risks involved, and Green Century&#8217;s prioritization of plastic avoidance over recycling as an environmental solution. Edited highlights follow: <\/em><\/p>\n<h3>What role can investors such as Green Century Funds play in driving firms to act against plastic waste?<\/h3>\n<p>I think that broadly all investors in companies where plastic waste is a feature of their production have a role to play. We can and must engage in dialogue with companies whose policies are lacking in the topic of plastic waste, or companies who are leaders and can really push the envelope, such as Colgate-Palmolive, where there is still progress to be made in the coming years, as the risks to investors [of insufficient action against plastic waste] will only multiply over time.<\/p>\n<h3>What are those risks, as you see them?<\/h3>\n<p>The key risks that are important to investors like us to consider are reputational risk, competitive risk and regulatory risk. From a reputational perspective, plastic remains higher than climate change as the top environmental concern among Americans, and I&#8217;m sure that&#8217;s replicated elsewhere. From a competitive standpoint, many companies are now setting similar goals, including absolute plastic reduction targets in some cases. And retailers have been increasing the ambition of their plastic reduction goals for their own-brand products. Regulatory pressure is increasing. In the US, statewide extended producer responsibility laws have been passed in the past two years in California, Colorado, Oregon and Maine. There are recycled content requirements under discussion in Washington, Connecticut and New Jersey, as well as national legislation and even the UN&#8217;s global plastics treaty, as well as a lot more regulatory action in Europe.<\/p>\n<h3>How have you seen the attitudes of companies and investors changing?<\/h3>\n<p>We have definitely seen a growing recognition from companies and investors that plastic pollution is a financial, competitive and regulatory risk that companies need to develop a plan to address comprehensively, and that investors need information about companies&#8217; actions to mitigate relevant portfolio risks. We feel companies need to start reporting their progress on reducing total plastic, in their annual sustainability reports as well as [non-profit organization] CDP&#8217;s new plastics disclosure program. As the public and legislators express increasing levels of concern about global plastic pollution, [we estimate] that brand owners could face an annual financial risk of approximately $100bn, should governments require them to cover the waste management costs of the plastic packaging they produce. Not only do [shareholder&#8217;s] attitudes seem to be more in favor of plastics related proposals, but the votes [on shareholder proposals put forward by Green Century Funds] reflect that. We won majority votes at General Mills in September and Sysco in November, which I think reflects that investors recognize these risks and are interested in companies addressing them. Because of that, and because of more research and reports being published about the financial risks, companies and investors are starting to pay more attention.<\/p>\n<h3>Your approach is focused on absolute plastic reduction and re-use, rather than recycling and recyclability. Does this indicate a mistrust in the effectiveness of the recycling industry?<\/h3>\n<p>At this point there is overwhelming evidence that we cannot recycle our way out of the plastic crisis. Experts say that we need to reduce demand for plastic by one-third to take control of the problem. There are abundant reports that have emerged in recent years that underscore that we must reduce the amount of plastic that we are pumping into the waste stream and secondly re-use the plastic that we do create, and then finally look to increased recycling as a solution. Recycling is certainly a key part of the solution, but it should not be a go-to according to the research that has been done recently. As with any complex problem there is no simple solution. We focus our efforts on reduce and re-use. We certainly support governments looking to strengthen recycling infrastructure, but we see it as a last resort.<\/p>\n<h3>As an investor, how cautious are you over the short-term costs of enacting more ambitious plastic targets, particularly in the current environment where rising costs have reduced sales volumes for some brand owners?<\/h3>\n<p>Short-term costs are definitely something that we take into consideration and are concerned about, but we are long-term investors in these companies, so we also think about the longer-term systemic risks that we need to address now to ensure the viability of the company in the long term. We often ask companies to report if and how they can scale up the pace and rigor of their efforts, including all of the costs involved. But I do also think it can be challenging to quantify all of the externalities that plastic waste creates. Plastic waste and climate change are both systemic risks, and we have to think about the risks in a number of contexts, even down to examples like pollution of waterways when companies we invest in rely on clean water to conduct their operations. There is no way to fully balance the short-term risks, but we come down on the side that it&#8217;s worth companies doing the research and due diligence to figure out what they can do and need to do.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Green Century has worked in recent years to push food, beverage and personal care brand companies to reduce their plastic packaging, develop more packaging reuse programs and introduce more transparent [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[940,969,855,973,970,974],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21282"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21282"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21282\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21282"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21282"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21282"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}