{"id":21298,"date":"2023-07-26T17:57:00","date_gmt":"2023-07-26T23:57:00","guid":{"rendered":"https:\/\/www.greencentury.com\/andrea-ranger-thats-right-the-ceo-just-called-me\/"},"modified":"2024-08-09T15:04:30","modified_gmt":"2024-08-09T21:04:30","slug":"thats-right-the-ceo-just-called-me","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/thats-right-the-ceo-just-called-me\/","title":{"rendered":"Andrea Ranger: That’s right. The CEO Just Called Me."},"content":{"rendered":"<p>Life as a shareholder advocate can be unpredictable – some of my work has a consistent flow, but I certainly wasn’t expecting an impromptu call from a CEO.<\/p>\n<p>Green Century<em>°<\/em> shareholder advocates often use the stakes in different companies on behalf of Green Century Funds, as a way of influencing management decisions on deforestation, carbon emissions, climate change, single-use plastic reductions and other issues with environmental impacts. I work on our insurance campaign pressing insurance companies to stop offering coverage for new fossil fuel projects. Not surprisingly, these insurers are not interested in changing their insurance strategies.<\/p>\n<p>During the year, shareholder advocates research the environmental risks that companies are exposed to or, worse yet, they create. And, we then communicate with companies by writing, calls, and face-to-face dialogue. When we can’t agree on a course of action, we present our concerns to fellow shareholders at companies’ annual meetings.<\/p>\n<p><img decoding=\"async\" class=\"size-medium wp-image-17793 alignleft\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2023\/07\/20230524_080651-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" \/><\/p>\n<p>Fast forward to the Travelers’* annual meeting in Hartford, CT. After I presented Green Century’s Funds’ shareholder proposal, I went on a treasure hunt to meet the company’s board of directors and CEO, Alan Schnitzer. Security guards were blocking my path to the board, but I managed to meet three directors. I was thrilled.<\/p>\n<p>I also asked to speak to Travelers’ CEO Alan Schnitzer, but he was busy. Then something special happened. As I reached my car to go home, Alan Schnitzer called me. I was sure it was a prank. It wasn’t.<\/p>\n<p>We exchanged pleasantries, but the conversation steered toward Green Century Funds’ shareholder proposal. He wasn’t happy with it. We had to agree to disagree on whether insuring new fossil fuel projects was the right thing to do. Spoiler alert – I didn’t think it was. I still don’t.<\/p>\n<p>A call from a CEO is a rare occurrence, and it signaled to me that Green Century Funds’ advocacy efforts were hitting their mark. However, I give a lot of credit to Travelers’ CEO for taking the time to call and listen to my concerns.<\/p>\n<p>Being tenacious, and professionally polite, can pay big dividends. Further, the effort to meet board members helped humanize the relationship between Green Century Funds and Travelers. I’ll meet with Travelers again later this year, but now we have a stronger rapport.<\/p>\n<p>It’s a privilege to be a shareholder advocate working on the toughest environmental challenges the world faces. Encounters with CEOs can result in better connections with corporate management. We always look for ways to collaborate, so we welcome phone calls from CEOs. Let’s work on solutions together.<\/p>\n<p><em>An investment strategy that incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n<p>Warmly, Andrea<\/p>\n<p><a href=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-1.png\"><img decoding=\"async\" class=\"alignnone wp-image-14468\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/2022\/12\/contact-us-button-1-300x169.png\" alt=\"\" width=\"233\" height=\"131\" \/><\/a><\/p>\n<p style=\"text-align: center;\">###<\/p>\n<div class=\"disclosures-content\"><p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (The Funds). The Green Century Funds are one of the first families of fossil fuel-free, environmentally responsible mutual funds. Green Century hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n<p><em>*As of June 30, 2023, The Travelers Companies, Inc. comprised 0.89%, 0.20%, and 0.00% of <\/em><a href=\"https:\/\/www.greencentury.com\/balanced-fund\/\"><em>Green Century Balanced Fund<\/em><\/a><em>, the <\/em><a href=\"https:\/\/www.greencentury.com\/equity-fund\/\"><em>Green Century Equity Fund<\/em><\/a><em>, and the <\/em><a href=\"https:\/\/www.greencentury.com\/international-index-fund\/\"><em>Green Century International Index Fund<\/em><\/a><em> respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/em><\/p>\n<p><strong><em>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/em><\/strong><\/p>\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk.<\/em><\/p>\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n<p><strong><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 7\/23<\/em><\/strong><\/p>\n<p><strong><em> <\/em><\/strong><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Life as a shareholder advocate can be unpredictable – some of my work has a consistent flow, but I certainly wasn’t expecting an impromptu call from a CEO. Green Century° [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[1019,929,865,856,854,857,862,863,853,981,982],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21298"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21298"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21298\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}