{"id":21303,"date":"2023-08-30T21:04:00","date_gmt":"2023-08-31T03:04:00","guid":{"rendered":"https:\/\/www.greencentury.com\/elliott-hyman-a-day-in-the-life-of-a-green-century-shareholder-advocacy-intern\/"},"modified":"2024-08-19T13:59:19","modified_gmt":"2024-08-19T19:59:19","slug":"elliott-hyman-a-day-in-the-life-of-a-green-century-shareholder-advocacy-intern","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/elliott-hyman-a-day-in-the-life-of-a-green-century-shareholder-advocacy-intern\/","title":{"rendered":"Elliott Hyman: A Day in the Life of a Green Century Shareholder Advocacy Intern"},"content":{"rendered":"<p>Working as a shareholder advocacy intern at Green Century° has given me valuable hands-on experience. I’ve done everything from meeting with executives from companies worth trillions of dollars to networking with environmental activists measuring pollution from waste at America’s beaches. I was drawn to this internship initially because I hoped to gain greater experience in corporate sustainability and learn how companies can drive action on climate change and other related environmental issues. Encouraging greater progress in these areas from an investor’s perspective intrigued me, as it appeared to be a radically different method than that of an external activist or company employee that I experienced before my internship.<\/p>\n<p>My work here has surpassed my expectations. I began my role by rapidly learning the fundamentals of shareholder advocacy and the methods used by investors to influence the sustainability of portfolio companies. I was quickly integrated into multiple ongoing company engagements across the annual dialogue cycles. These involved early research and initial letters of inquiry to presentations of shareholder proposals at annual shareholder meetings. I’ve had the opportunity to leverage tools available only to investors, such as shareholder proposals – recommendations made to a company’s Board by investors which are voted on by shareholders at the annual shareholder meeting – and withdrawal agreement discussions – negotiations with companies with the goal of reaching a commitment from the firm to act on a sustainability issue in exchange of our removal of a shareholder proposal before it goes to a vote. I’ve also gotten to engage with companies across a broad spectrum of issues, including protecting forests, reducing plastic use and pollution, creating climate transition plans, and responding to nature-related financial risks such as biodiversity loss.<\/p>\n<p>I was also able to take part in face-to-face meetings. One day a few weeks ago, I came in early and had breakfast with members of teams from Environment America and the Public Interest Research Network. We spoke about their canvassing efforts, legal campaigns, and environmental policy research over coffee and bagels as well as the work we had been doing at Green Century. Gaining access to experts and meeting people in a larger network was a valuable aspect of my internship.<\/p>\n<p>The internship also gave me a chance to pursue some independent projects. After returning from my in-person meeting, I started researching Green Century’s strategy for engaging with portfolio companies in the burgeoning area of nature and biodiversity risk. Investors and companies across a wide array of industries have become increasingly aware of the financial risks they face due to species loss, ecosystem degradation, and the decline of “natural capital”. I began my work on the project by researching the industries most exposed to biodiversity risk and noted the increased attention on the issue among global policymakers and companies, and then presented my findings to the Shareholder Advocacy team. Next, I worked to identify firms that lagged peers in disclosing and addressing these exposures. I considered what we may want to include in a shareholder proposal to most effectively prompt these firms to mitigate these risks. After collaborating with the shareholder advocates to expand these ideas and decide on a route of action, I have since drafted letters of inquiry for companies to begin our engagements on the subject. This is generally the first step of engagement with a company in the advocacy process.<\/p>\n<p>Later that afternoon, I met with executives from a construction company that Green Century had previously engaged with to set more robust targets to reduce deforestation in their supply chain and to reduce their greenhouse gas emissions to assess their progress on these goals. Having the chance to speak with senior management from many types of companies to learn about their strategies and progress on sustainability issues has been invaluable to me in learning how to drive change when faced with resource constraints, trade-offs, and institutional uncertainty over the financial benefits from responding to environmental crises.<\/p>\n<p>I would strongly recommend the internship to college students passionate about environmental sustainability and catalyzing change at the company level. I feel that I will come out of the role far more knowledgeable about the key sustainability issues facing companies today and about the tools at the disposal of investors to drive corporate action to mitigate climate and environmental risks. My time at Green Century has felt exciting and dynamic, and I am proud of the work that I’ve done to respond to some of the most pressing issues of our time.<\/p>\n<p><em>Bio: Elliott Hyman is a Shareholder Advocacy intern at Green Century. He is a rising senior at Harvard University studying Economics with a minor in Energy &amp; Environment. <\/em><\/p>\n<div class=\"disclosures-content\"><p>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds).<\/p>\n<p>The Green Century Funds are a family of fossil fuel-free, environmentally responsible mutual funds. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/p>\n<p><strong>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing. <\/strong><\/p>\n<p>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/p>\n<p>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/p>\n<p>The Green Century Funds are distributed by UMB Distribution Services, LLC. 235 W Galena Street, Milwaukee, WI 53212. 8\/23. UMB and Green Century are not affiliated.<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Working as a shareholder advocacy intern at Green Century° has given me valuable hands-on experience. I’ve done everything from meeting with executives from companies worth trillions of dollars to networking [&hellip;]<\/p>\n","protected":false},"author":22,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21303"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/22"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=21303"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/21303\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=21303"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=21303"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=21303"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}