{"id":22503,"date":"2024-07-08T14:48:53","date_gmt":"2024-07-08T20:48:53","guid":{"rendered":"https:\/\/www.greencentury.com\/?p=22503"},"modified":"2024-08-08T06:14:05","modified_gmt":"2024-08-08T12:14:05","slug":"who-can-you-count-on","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/who-can-you-count-on\/","title":{"rendered":"Who Can You Count On?"},"content":{"rendered":"\n<p><em>Parnassus drops its exclusionary screens while Green Century reaffirms its commitment to them.<\/em><br><br>Parnassus Investments recently announced that they were dropping the exclusionary screens it used to restrict the types of companies it invested in. This change opens the floodgates for Parnassus to now invest in every industry, including the ones that they had previously eschewed including:<br><br>• Coal<br>• Oil<br>• Fracking<br>• Tobacco<br>• Guns<br>• Military Weapons<br>• Nuclear Energy<br><br>Why did this change happen? From our point of view, it can’t be because the companies in these industries have changed their core businesses. Tobacco companies produce products that are harmful and potentially fatal to people who smoke and nonsmokers alike.<br><br>Oil companies are still damaging ecosystems in pursuit of a product that scientists link to erratic weather and nuclear energy still produces radioactive waste.<br><br>We believe this rollback will have consequences for Parnassus investors and the financial advisors who have used their funds. The impact is that everyday investors, financial advisors who work with them, and institutional investors may no longer count on Parnassus to keep their clients out of these industries. After seeing Parnassus alter its alignment on previous commitments, advisors may become wary of using Parnassus funds for their clients. As one advisor told us, “We’re not happy with this move. Green Century is one of the few firms I feel like I can trust now.”<br><br>Green Century has worked hard to build that trust for 34 years. I can reiterate our commitment to our investors. We were founded as a firm for people who wanted to align their environmental values with their investments as they saved for the future. In 2014, we became one of the first fossil fuel-free, environmentally responsible fund families. Not every company we invest in is perfect. Still, when we see room for improvement in those companies, we lead a rigorous shareholder advocacy program to negotiate better environmental policies, such as sourcing more clean energy and reducing the use of plastics.<\/p>\n\n\n\n<p>We won’t stray from our mission because our values are baked into our DNA. We are owned by environmental and public health non-profit organizations that speak out for the public and stand up to special interests about problems that affect the public’s health, safety and well-being. That’s who we have been for more than three decades and that’s who will continue to be. You can count on us.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>&#8212;Leslie Samuelrich, President, Green Century Funds<\/p>\n\n\n\n<p><em>A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><\/h2>\n\n\n\n<p><\/p>\n<div class=\"disclosures-content\"><p><!-- wp:paragraph --><\/p>\n<p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds).<\/em><\/p>\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\n<p><em>The Green Century Funds are a family of fossil fuel-free, environmentally responsible mutual funds. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\n<p><strong> You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit <u>www.greencentury.com<\/u>, email <\/strong><a href=\"mailto:info@greencentury.com\"><strong>info@greencentury.com<\/strong><\/a><strong>, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/strong><\/p>\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk.<\/em><\/p>\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><\/p>\n<p><!-- \/wp:paragraph --> <!-- wp:paragraph --><\/p>\n<p><em>The Green Century Funds are distributed by UMB Distribution Services, LLC. 7\/24. UMB and Green Century are not affiliated.<\/em><\/p>\n<p><!-- \/wp:paragraph --><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Parnassus drops its exclusionary screens while Green Century reaffirms its commitment to them. Parnassus Investments recently announced that they were dropping the exclusionary screens it used to restrict the types [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":22593,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[1205,1206,1208,1209,1210,998,1204,1211],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/22503"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=22503"}],"version-history":[{"count":0,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/22503\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media\/22593"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=22503"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=22503"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=22503"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}