{"id":24043,"date":"2024-11-25T07:38:00","date_gmt":"2024-11-25T14:38:00","guid":{"rendered":"https:\/\/www.greencentury.com\/?p=24043"},"modified":"2024-11-25T08:02:26","modified_gmt":"2024-11-25T15:02:26","slug":"request-for-review-of-tds-governance","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/request-for-review-of-tds-governance\/","title":{"rendered":"Request for Review of TD&#8217;s Governance"},"content":{"rendered":"\n<p><strong>November 22, 2024, Toronto, Ontario<\/strong> &#8211; Today, in light of governance concerns at TD Bank, including its money laundering scandal and stalled progress on its net zero commitment, Investors for Paris Compliance, along with Green Century Capital Management, Nomura Asset Management UK, and Vancity Investment Management, have filed a shareholder resolution requesting an independent review of TD’s governance processes, including its board nomination policies.<\/p>\n\n\n\n<p>“In light of the bank’s recently exposed governance failures, we are looking for board accountability and renewal, including that new board members are properly qualified to manage major risks and opportunities.” said Kyra Bell-Pasht, of Investors for Paris Compliance.<br>On money laundering, while TD has said “we take full responsibility,” there has not been an explanation about how the board’s Audit Committee failed to prevent the scandal when it had oversight of relevant systems. While the current CEO will be replaced at the next AGM, to date no board members have indicated they will be resigning to take responsibility.<\/p>\n\n\n\n<p><strong>On Net Zero, TD Fares Poorly<br><\/strong><br>On net zero, TD fares poorly in a series of independent assessments, and the board is yet to respond to two years of about a quarter of its shareholders expressing concern about its net zero plans. TD currently has three directors – Claude Mongeau, S. Jane Rowe, and Nancy Tower – who also serve as directors of fossil fuel companies. A fourth, Brian Ferguson, is an ex-CEO of a fossil fuel company. No TD director has experience with climate solutions.<br><br>Alex Rowe, of Nomura Asset Management UK, with over €500 billion in AUM, explained their decision to co-file again, this time with an escalated focus on governance:<br>“In Europe, there is increasing pressure for us to fulfill our own net zero commitments, which means escalating engagements with companies in our portfolio that are failing to progress on their net zero commitments, like TD.”<br><br>Giovanna Eichner of Green Century Capital Management°, explained:<br>“As one of the longest-standing sustainable asset managers in North America, we have long understood the value proposition of considering externalities. This is why we want to ensure TD Bank has leadership in place to foresee and manage key existing and emerging risks.”<br><br>Morrigan Simpson-Marran\/ Kelly Hirsch, of Vancity Investment Management explained that:<br>“Our members have made it clear that short-term profits are less important than long-term economic stability and the health of our planet. That is why we encourage companies in our investment portfolio to progress on their net zero commitments. We are now looking for assurance that TD leadership is up to the task.”<br><br>Investors for Paris Compliance works with investors to hold Canadian publicly traded companies accountable to their net zero promises.<\/p>\n<div class=\"disclosures-content\"><p>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds).<br \/>\nThe Green Century Funds are a family of fossil fuel-free, environmentally responsible mutual funds. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/p>\n<p>*As of November 19, 2024, TD Bank comprised 0.00%, 0.00%, and 2.40% of Green Century Balanced Fund, the Green Century Equity Fund, and the Green Century International Index Fund respectively. As of the same date, other securities mentioned were not held in the portfolios of any of the Green Century Funds. References to specific securities, which will change due to ongoing management of the Funds, should not be construed as a recommendation by the Funds, their administrator, or their distributor.<\/p>\n<p><strong>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing. <\/strong><\/p>\n<p>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/p>\n<p>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/p>\n<p>The Green Century Funds are distributed by UMB Distribution Services, LLC. 11\/19. UMB and Green Century are not affiliated.<br \/>\n###<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>November 22, 2024, Toronto, Ontario &#8211; Today, in light of governance concerns at TD Bank, including its money laundering scandal and stalled progress on its net zero commitment, Investors for [&hellip;]<\/p>\n","protected":false},"author":18,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[1],"tags":[865,850,856,1224,854,857,851,1225,957,853,1223],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/24043"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=24043"}],"version-history":[{"count":4,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/24043\/revisions"}],"predecessor-version":[{"id":24050,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/24043\/revisions\/24050"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=24043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=24043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=24043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}