{"id":25051,"date":"2025-02-21T11:18:03","date_gmt":"2025-02-21T18:18:03","guid":{"rendered":"https:\/\/www.greencentury.com\/?p=25051"},"modified":"2025-02-21T11:20:18","modified_gmt":"2025-02-21T18:20:18","slug":"new-advocate-seeks-environmental-action-by-companies","status":"publish","type":"post","link":"https:\/\/www.greencentury.com\/new-advocate-seeks-environmental-action-by-companies\/","title":{"rendered":"New Advocate Seeks Environmental Action by Companies"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" width=\"568\" height=\"571\" src=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Screenshot-2025-02-20-165528.png\" alt=\"\" class=\"wp-image-25054\" srcset=\"https:\/\/www.greencentury.com\/wp-content\/uploads\/Screenshot-2025-02-20-165528.png 568w, https:\/\/www.greencentury.com\/wp-content\/uploads\/Screenshot-2025-02-20-165528-298x300.png 298w, https:\/\/www.greencentury.com\/wp-content\/uploads\/Screenshot-2025-02-20-165528-150x150.png 150w\" sizes=\"(max-width: 568px) 100vw, 568px\" \/><\/figure>\n\n\n\n<p>The <a href=\"https:\/\/www.greencentury.com\/our-impact\/\">award-winning shareholder advocacy team<\/a> at Green Century°, supported by investors, help create real-world impact on myriad environmental issues. Advocates work on issues such as cutting plastic pollution, protecting forests, promoting clean energy and on other environmental fronts.<\/p>\n\n\n\n<p>Frances Fairhead-Stanova, who joined the shareholder advocacy team in September, adds an international background and varied experiences to the team. Originally from Cape Town, South Africa, her advocacy work at Green Century focuses on plastics, animal welfare, tackling e-waste and right to repair issues.<\/p>\n\n\n\n<p>“Green Century has a strong reputation for really effective shareholder engagement,” she said. “I wanted to work in a place where engagement was a priority and also part of the mission.”<br>Her passion for the environment began as a child. She and her husband are raising their daughter with similar values and respect for the planet.<\/p>\n\n\n\n<p>“What makes me care about the environment is spending a lot of time in nature growing up in a<br>family that valued and protected the environment,” she said. “I’m really inspired by things I see in my everyday life that resonate environmentally. For example, I see excessive use of plastics in packaging at grocery stores.”<\/p>\n\n\n\n<p>Her shareholder advocacy work has won concessions from companies, such as disclosing how they are investing in new alternatives to plastic packaging. In her work, companies have also agreed to remove misleading recyclable labels from their plastic packaging. These efforts help prevent more plastic waste and help consumers understand the recyclability of their plastic packaging.<\/p>\n\n\n\n<p>Frances said that it is important to research and understand how companies and their customers view sustainability.<br>“Sometimes you can help a company understand what its customers are looking for on an issue and how it aligns with their business, even if they don’t realize it yet,&#8221; she said. “Rather than just pushing for something, we work to find something that the company can embrace and embed into its strategy.”<\/p>\n\n\n\n<p>She said she enjoys working with Green Century’s shareholder advocacy team.<\/p>\n\n\n\n<p>“The people I work with are great and are really dedicated, helpful and effective,&#8221; she said. “They are great at teaching and growing others. The other part is seeing the outcomes of my work, because that is why I am here.”<\/p>\n<div class=\"disclosures-content\"><p><em>°Green Century Capital Management, Inc. (Green Century) is the investment advisor to the Green Century Funds (the Funds).<\/em><\/p>\n<p><em>The Green Century Funds are a family of fossil fuel-free, environmentally responsible mutual funds. Green Century Capital Management hosts an award-winning and in-house shareholder advocacy program and is the only mutual fund company in the U.S. wholly owned by environmental and public health nonprofit organizations.<\/em><\/p>\n<p><strong>You should carefully consider the Fund’s investment objectives, risks, charges, and expenses before investing. To obtain a Prospectus that contains this and other information about the Funds please visit www.greencentury.com, email info@greencentury.com, or call 1-800-934-7336. Please read the Prospectus carefully before investing.<\/strong><\/p>\n<p><em>Stocks will fluctuate in response to factors that may affect a single company, industry, sector, country, region or the market as a whole and may perform worse than the market. Foreign securities are subject to additional risks such as currency fluctuations, regional economic and political conditions, differences in accounting methods, and other unique risks compared to investing in securities of U.S. issuers. Bonds are subject to a variety of risks including interest rate, credit, and inflation risk. A sustainable investment strategy which incorporates environmental, social and governance criteria may result in lower or higher returns than an investment strategy that does not include such criteria.<\/em><\/p>\n<p><em>This information has been prepared from sources believed reliable. The views expressed are as the date of this writing and are those of the Advisor to the Funds.<\/em><br \/>\n<em>The Green Century Funds are distributed by Distribution Services, LLC. 2\/25. Distribution Services and Green Century are not affiliated.<\/em><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The award-winning shareholder advocacy team at Green Century°, supported by investors, help create real-world impact on myriad environmental issues. Advocates work on issues such as cutting plastic pollution, protecting forests, [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"rank_math_lock_modified_date":false,"_EventAllDay":false,"_EventTimezone":"","_EventStartDate":"","_EventEndDate":"","_EventStartDateUTC":"","_EventEndDateUTC":"","_EventShowMap":false,"_EventShowMapLink":false,"_EventURL":"","_EventCost":"","_EventCostDescription":"","_EventCurrencySymbol":"","_EventCurrencyCode":"","_EventCurrencyPosition":"","_EventDateTimeSeparator":"","_EventTimeRangeSeparator":"","_EventOrganizerID":[],"_EventVenueID":[],"_OrganizerEmail":"","_OrganizerPhone":"","_OrganizerWebsite":"","_VenueAddress":"","_VenueCity":"","_VenueCountry":"","_VenueProvince":"","_VenueState":"","_VenueZip":"","_VenuePhone":"","_VenueURL":"","_VenueStateProvince":"","_VenueLat":"","_VenueLng":"","_VenueShowMap":false,"_VenueShowMapLink":false,"_tribe_blocks_recurrence_rules":"","_tribe_blocks_recurrence_description":"","_tribe_blocks_recurrence_exclusions":"","footnotes":""},"categories":[310],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/25051"}],"collection":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/comments?post=25051"}],"version-history":[{"count":3,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/25051\/revisions"}],"predecessor-version":[{"id":25055,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/posts\/25051\/revisions\/25055"}],"wp:attachment":[{"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/media?parent=25051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/categories?post=25051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.greencentury.com\/wp-json\/wp\/v2\/tags?post=25051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}